Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/powman.h
// THIS HEADER FILE IS AUTOMATICALLY GENERATED -- DO NOT EDIT

/**
 * Copyright (c) 2024 Raspberry Pi Ltd.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
// =============================================================================
// Register block : POWMAN
// Version        : 1
// Bus type       : apb
// Description    : Controls vreg, bor, lposc, chip resets & xosc startup,
//                  powman and provides scratch register for general use and for
//                  bootcode use
// =============================================================================
#ifndef _HARDWARE_REGS_POWMAN_H
#define _HARDWARE_REGS_POWMAN_H
// =============================================================================
// Register    : POWMAN_BADPASSWD
// Description : Indicates a bad password has been used
#define POWMAN_BADPASSWD_OFFSET _u(0x00000000)
#define POWMAN_BADPASSWD_BITS   _u(0x00000001)
#define POWMAN_BADPASSWD_RESET  _u(0x00000000)
#define POWMAN_BADPASSWD_MSB    _u(0)
#define POWMAN_BADPASSWD_LSB    _u(0)
#define POWMAN_BADPASSWD_ACCESS "WC"
// =============================================================================
// Register    : POWMAN_VREG_CTRL
// Description : Voltage Regulator Control
#define POWMAN_VREG_CTRL_OFFSET _u(0x00000004)
#define POWMAN_VREG_CTRL_BITS   _u(0x0000b170)
#define POWMAN_VREG_CTRL_RESET  _u(0x00008050)
// -----------------------------------------------------------------------------
// Field       : POWMAN_VREG_CTRL_RST_N
// Description : returns the regulator to its startup settings
//               0 - reset
//               1 - not reset (default)
#define POWMAN_VREG_CTRL_RST_N_RESET  _u(0x1)
#define POWMAN_VREG_CTRL_RST_N_BITS   _u(0x00008000)
#define POWMAN_VREG_CTRL_RST_N_MSB    _u(15)
#define POWMAN_VREG_CTRL_RST_N_LSB    _u(15)
#define POWMAN_VREG_CTRL_RST_N_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : POWMAN_VREG_CTRL_UNLOCK
// Description : unlocks the VREG control interface after power up
//               0 - Locked (default)
//               1 - Unlocked
//               It cannot be relocked when it is unlocked.
#define POWMAN_VREG_CTRL_UNLOCK_RESET  _u(0x0)
#define POWMAN_VREG_CTRL_UNLOCK_BITS   _u(0x00002000)
#define POWMAN_VREG_CTRL_UNLOCK_MSB    _u(13)
#define POWMAN_VREG_CTRL_UNLOCK_LSB    _u(13)
#define POWMAN_VREG_CTRL_UNLOCK_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : POWMAN_VREG_CTRL_ISOLATE
// Description : isolates the VREG control interface
//               0 - not isolated (default)
//               1 - isolated
#define POWMAN_VREG_CTRL_ISOLATE_RESET  _u(0x0)
#define POWMAN_VREG_CTRL_ISOLATE_BITS   _u(0x00001000)
#define POWMAN_VREG_CTRL_ISOLATE_MSB    _u(12)
#define POWMAN_VREG_CTRL_ISOLATE_LSB    _u(12)
#define POWMAN_VREG_CTRL_ISOLATE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : POWMAN_VREG_CTRL_DISABLE_VOLTAGE_LIMIT
// Description : 0=not disabled, 1=enabled
#define POWMAN_VREG_CTRL_DISABLE_VOLTAGE_LIMIT_RESET  _u(0x0)
#define POWMAN_VREG_CTRL_DISABLE_VOLTAGE_LIMIT_BITS   _u(0x00000100)
#define POWMAN_VREG_CTRL_DISABLE_VOLTAGE_LIMIT_MSB    _u(8)
#define POWMAN_VREG_CTRL_DISABLE_VOLTAGE_LIMIT_LSB    _u(8)
#define POWMAN_VREG_CTRL_DISABLE_VOLTAGE_LIMIT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : POWMAN_VREG_CTRL_HT_TH
// Description : high temperature protection threshold
//               regulator power transistors are disabled when junction
//               temperature exceeds threshold
//               000 - 100C
//               001 - 105C
//               010 - 110C
//               011 - 115C
//               100 - 120C
//               101 - 125C
//               110 - 135C
//               111 - 150C
#define POWMAN_VREG_CTRL_HT_TH_RESET  _u(0x5)
#define POWMAN_VREG_CTRL_HT_TH_BITS   _u(0x00000070)
#define POWMAN_VREG_CTRL_HT_TH_MSB    _u(6)
#define POWMAN_VREG_CTRL_HT_TH_LSB    _u(4)
#define POWMAN_VREG_CTRL_HT_TH_ACCESS "RW"
// =============================================================================
// Register    : POWMAN_VREG_STS
// Description : Voltage Regulator Status
#define POWMAN_VREG_STS_OFFSET _u(0x00000008)
#define POWMAN_VREG_STS_BITS   _u(0x00000011)
#define POWMAN_VREG_STS_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : POWMAN_VREG_STS_VOUT_OK
// Description : output regulation status
//               0=not in regulation, 1=in regulation
#define POWMAN_VREG_STS_VOUT_OK_RESET  _u(0x0)
#define POWMAN_VREG_STS_VOUT_OK_BITS   _u(0x00000010)
#define POWMAN_VREG_STS_VOUT_OK_MSB    _u(4)
#define POWMAN_VREG_STS_VOUT_OK_LSB    _u(4)
#define POWMAN_VREG_STS_VOUT_OK_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : POWMAN_VREG_STS_STARTUP
// Description : startup status
//               0=startup complete, 1=starting up
#define POWMAN_VREG_STS_STARTUP_RESET  _u(0x0)
#define POWMAN_VREG_STS_STARTUP_BITS   _u(0x00000001)
#define POWMAN_VREG_STS_STARTUP_MSB    _u(0)
#define POWMAN_VREG_STS_STARTUP_LSB    _u(0)
#define POWMAN_VREG_STS_STARTUP_ACCESS "RO"
// =============================================================================
// Register    : POWMAN_VREG
// Description : Voltage Regulator Settings
#define POWMAN_VREG_OFFSET _u(0x0000000c)
#define POWMAN_VREG_BITS   _u(0x000081f2)
#define POWMAN_VREG_RESET  _u(0x000000b0)
// -----------------------------------------------------------------------------
// Field       : POWMAN_VREG_UPDATE_IN_PROGRESS
// Description : regulator state is being updated
//               writes to the vreg register will be ignored when this field is
//               set
#define POWMAN_VREG_UPDATE_IN_PROGRESS_RESET  _u(0x0)
#define POWMAN_VREG_UPDATE_IN_PROGRESS_BITS   _u(0x00008000)
#define POWMAN_VREG_UPDATE_IN_PROGRESS_MSB    _u(15)
#define POWMAN_VREG_UPDATE_IN_PROGRESS_LSB    _u(15)
#define POWMAN_VREG_UPDATE_IN_PROGRESS_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : POWMAN_VREG_VSEL
// Description : output voltage select
//               the regulator output voltage is limited to 1.3V unless the
//               voltage limit
//               is disabled using the disable_voltage_limit field in the
//               vreg_ctrl register
//               00000 - 0.55V
//               00001 - 0.60V
//               00010 - 0.65V
//               00011 - 0.70V
//               00100 - 0.75V
//               00101 - 0.80V
//               00110 - 0.85V
//               00111 - 0.90V
//               01000 - 0.95V
//               01001 - 1.00V
//               01010 - 1.05V
//               01011 - 1.10V (default)
//               01100 - 1.15V
//               01101 - 1.20V
//               01110 - 1.25V
//               01111 - 1.30V
//               10000 - 1.35V
//               10001 - 1.40V
//               10010 - 1.50V
//               10011 - 1.60V
//               10100 - 1.65V
//               10101 - 1.70V
//               10110 - 1.80V
//               10111 - 1.90V
//               11000 - 2.00V
//               11001 - 2.35V
//               11010 - 2.50V
//               11011 - 2.65V
//               11100 - 2.80V
//               11101 - 3.00V
//               11110 - 3.15V
//               11111 - 3.30V
#define POWMAN_VREG_VSEL_RESET  _u(0x0b)
#define POWMAN_VREG_VSEL_BITS   _u(0x000001f0)
#define POWMAN_VREG_VSEL_MSB    _u(8)
#define POWMAN_VREG_VSEL_LSB    _u(4)
#define POWMAN_VREG_VSEL_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : POWMAN_VREG_HIZ
// Description : high impedance mode select
//               0=not in high impedance mode, 1=in high impedance mode
#define POWMAN_VREG_HIZ_RESET  _u(0x0)
#define POWMAN_VREG_HIZ_BITS   _u(0x00000002)
#define POWMAN_VREG_HIZ_MSB    _u(1)
#define POWMAN_VREG_HIZ_LSB    _u(1)
#define POWMAN_VREG_HIZ_ACCESS "RW"
// =============================================================================
// Register    : POWMAN_VREG_LP_ENTRY
// Description : Voltage Regulator Low Power Entry Settings
#define POWMAN_VREG_LP_ENTRY_OFFSET _u(0x00000010)
#define POWMAN_VREG_LP_ENTRY_BITS   _u(0x000001f6)
#define POWMAN_VREG_LP_ENTRY_RESET  _u(0x000000b4)
// -----------------------------------------------------------------------------
// Field       : POWMAN_VREG_LP_ENTRY_VSEL
// Description : output voltage select
//               the regulator output voltage is limited to 1.3V unless the
//               voltage limit
//               is disabled using the disable_voltage_limit field in the
//               vreg_ctrl register
//               00000 - 0.55V
//               00001 - 0.60V
//               00010 - 0.65V
//               00011 - 0.70V
//               00100 - 0.75V
//               00101 - 0.80V
//               00110 - 0.85V
//               00111 - 0.90V
//               01000 - 0.95V
//               01001 - 1.00V
//               01010 - 1.05V
//               01011 - 1.10V (default)
//               01100 - 1.15V
//               01101 - 1.20V
//               01110 - 1.25V
//               01111 - 1.30V
//               10000 - 1.35V
//               10001 - 1.40V
//               10010 - 1.50V
//               10011 - 1.60V
//               10100 - 1.65V
//               10101 - 1.70V
//               10110 - 1.80V
//               10111 - 1.90V
//               11000 - 2.00V
//               11001 - 2.35V
//               11010 - 2.50V
//               11011 - 2.65V
//               11100 - 2.80V
//               11101 - 3.00V
//               11110 - 3.15V
//               11111 - 3.30V
#define POWMAN_VREG_LP_ENTRY_VSEL_RESET  _u(0x0b)
#define POWMAN_VREG_LP_ENTRY_VSEL_BITS   _u(0x000001f0)
#define POWMAN_VREG_LP_ENTRY_VSEL_MSB    _u(8)
#define POWMAN_VREG_LP_ENTRY_VSEL_LSB    _u(4)
#define POWMAN_VREG_LP_ENTRY_VSEL_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : POWMAN_VREG_LP_ENTRY_MODE
// Description : selects either normal (switching) mode or low power (linear)
//               mode
//               low power mode can only be selected for output voltages up to
//               1.3V
//               0 = normal mode (switching)
//               1 = low power mode (linear)
#define POWMAN_VREG_LP_ENTRY_MODE_RESET  _u(0x1)
#define POWMAN_VREG_LP_ENTRY_MODE_BITS   _u(0x00000004)
#define POWMAN_VREG_LP_ENTRY_MODE_MSB    _u(2)
#define POWMAN_VREG_LP_ENTRY_MODE_LSB    _u(2)
#define POWMAN_VREG_LP_ENTRY_MODE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : POWMAN_VREG_LP_ENTRY_HIZ
// Description : high impedance mode select
//               0=not in high impedance mode, 1=in high impedance mode
#define POWMAN_VREG_LP_ENTRY_HIZ_RESET  _u(0x0)
#define POWMAN_VREG_LP_ENTRY_HIZ_BITS   _u(0x00000002)
#define POWMAN_VREG_LP_ENTRY_HIZ_MSB    _u(1)
#define POWMAN_VREG_LP_ENTRY_HIZ_LSB    _u(1)
#define POWMAN_VREG_LP_ENTRY_HIZ_ACCESS "RW"
// =============================================================================
// Register    : POWMAN_VREG_LP_EXIT
// Description : Voltage Regulator Low Power Exit Settings
#define POWMAN_VREG_LP_EXIT_OFFSET _u(0x00000014)
#define POWMAN_VREG_LP_EXIT_BITS   _u(0x000001f6)
#define POWMAN_VREG_LP_EXIT_RESET  _u(0x000000b0)
// -----------------------------------------------------------------------------
// Field       : POWMAN_VREG_LP_EXIT_VSEL
// Description : output voltage select
//               the regulator output voltage is limited to 1.3V unless the
//               voltage limit
//               is disabled using the disable_voltage_limit field in the
//               vreg_ctrl register
//               00000 - 0.55V
//               00001 - 0.60V
//               00010 - 0.65V
//               00011 - 0.70V
//               00100 - 0.75V
//               00101 - 0.80V
//               00110 - 0.85V
//               00111 - 0.90V
//               01000 - 0.95V
//               01001 - 1.00V
//               01010 - 1.05V
//               01011 - 1.10V (default)
//               01100 - 1.15V
//               01101 - 1.20V
//               01110 - 1.25V
//               01111 - 1.30V
//               10000 - 1.35V
//               10001 - 1.40V
//               10010 - 1.50V
//               10011 - 1.60V
//               10100 - 1.65V
//               10101 - 1.70V
//               10110 - 1.80V
//               10111 - 1.90V
//               11000 - 2.00V
//               11001 - 2.35V
//               11010 - 2.50V
//               11011 - 2.65V
//               11100 - 2.80V
//               11101 - 3.00V
//               11110 - 3.15V
//               11111 - 3.30V
#define POWMAN_VREG_LP_EXIT_VSEL_RESET  _u(0x0b)
#define POWMAN_VREG_LP_EXIT_VSEL_BITS   _u(0x000001f0)
#define POWMAN_VREG_LP_EXIT_VSEL_MSB    _u(8)
#define POWMAN_VREG_LP_EXIT_VSEL_LSB    _u(4)
#define POWMAN_VREG_LP_EXIT_VSEL_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : POWMAN_VREG_LP_EXIT_MODE
// Description : selects either normal (switching) mode or low power (linear)
//               mode
//               low power mode can only be selected for output voltages up to
//               1.3V
//               0 = normal mode (switching)
//               1 = low power mode (linear)
#define POWMAN_VREG_LP_EXIT_MODE_RESET  _u(0x0)
#define POWMAN_VREG_LP_EXIT_MODE_BITS   _u(0x00000004)
#define POWMAN_VREG_LP_EXIT_MODE_MSB    _u(2)
#define POWMAN_VREG_LP_EXIT_MODE_LSB    _u(2)
#define POWMAN_VREG_LP_EXIT_MODE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : POWMAN_VREG_LP_EXIT_HIZ
// Description : high impedance mode select
//               0=not in high impedance mode, 1=in high impedance mode
#define POWMAN_VREG_LP_EXIT_HIZ_RESET  _u(0x0)
#define POWMAN_VREG_LP_EXIT_HIZ_BITS   _u(0x00000002)
#define POWMAN_VREG_LP_EXIT_HIZ_MSB    _u(1)
#define POWMAN_VREG_LP_EXIT_HIZ_LSB    _u(1)
#define POWMAN_VREG_LP_EXIT_HIZ_ACCESS "RW"
// =============================================================================
// Register    : POWMAN_BOD_CTRL
// Description : Brown-out Detection Control
#define POWMAN_BOD_CTRL_OFFSET _u(0x00000018)
#define POWMAN_BOD_CTRL_BITS   _u(0x00001000)
#define POWMAN_BOD_CTRL_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : POWMAN_BOD_CTRL_ISOLATE
// Description : isolates the brown-out detection control interface
//               0 - not isolated (default)
//               1 - isolated
#define POWMAN_BOD_CTRL_ISOLATE_RESET  _u(0x0)
#define POWMAN_BOD_CTRL_ISOLATE_BITS   _u(0x00001000)
#define POWMAN_BOD_CTRL_ISOLATE_MSB    _u(12)
#define POWMAN_BOD_CTRL_ISOLATE_LSB    _u(12)
#define POWMAN_BOD_CTRL_ISOLATE_ACCESS "RW"
// =============================================================================
// Register    : POWMAN_BOD
// Description : Brown-out Detection Settings
#define POWMAN_BOD_OFFSET _u(0x0000001c)
#define POWMAN_BOD_BITS   _u(0x000001f1)
#define POWMAN_BOD_RESET  _u(0x000000b1)
// -----------------------------------------------------------------------------
// Field       : POWMAN_BOD_VSEL
// Description : threshold select
//               00000 - 0.473V
//               00001 - 0.516V
//               00010 - 0.559V
//               00011 - 0.602V
//               00100 - 0.645VS
//               00101 - 0.688V
//               00110 - 0.731V
//               00111 - 0.774V
//               01000 - 0.817V
//               01001 - 0.860V (default)
//               01010 - 0.903V
//               01011 - 0.946V
//               01100 - 0.989V
//               01101 - 1.032V
//               01110 - 1.075V
//               01111 - 1.118V
//               10000 - 1.161
//               10001 - 1.204V
#define POWMAN_BOD_VSEL_RESET  _u(0x0b)
#define POWMAN_BOD_VSEL_BITS   _u(0x000001f0)
#define POWMAN_BOD_VSEL_MSB    _u(8)
#define POWMAN_BOD_VSEL_LSB    _u(4)
#define POWMAN_BOD_VSEL_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : POWMAN_BOD_EN
// Description : enable brown-out detection
//               0=not enabled, 1=enabled
#define POWMAN_BOD_EN_RESET  _u(0x1)
#define POWMAN_BOD_EN_BITS   _u(0x00000001)
#define POWMAN_BOD_EN_MSB    _u(0)
#define POWMAN_BOD_EN_LSB    _u(0)
#define POWMAN_BOD_EN_ACCESS "RW"
// =============================================================================
// Register    : POWMAN_BOD_LP_ENTRY
// Description : Brown-out Detection Low Power Entry Settings
#define POWMAN_BOD_LP_ENTRY_OFFSET _u(0x00000020)
#define POWMAN_BOD_LP_ENTRY_BITS   _u(0x000001f1)
#define POWMAN_BOD_LP_ENTRY_RESET  _u(0x000000b0)
// -----------------------------------------------------------------------------
// Field       : POWMAN_BOD_LP_ENTRY_VSEL
// Description : threshold select
//               00000 - 0.473V
//               00001 - 0.516V
//               00010 - 0.559V
//               00011 - 0.602V
//               00100 - 0.645VS
//               00101 - 0.688V
//               00110 - 0.731V
//               00111 - 0.774V
//               01000 - 0.817V
//               01001 - 0.860V (default)
//               01010 - 0.903V
//               01011 - 0.946V
//               01100 - 0.989V
//               01101 - 1.032V
//               01110 - 1.075V
//               01111 - 1.118V
//               10000 - 1.161
//               10001 - 1.204V
#define POWMAN_BOD_LP_ENTRY_VSEL_RESET  _u(0x0b)
#define POWMAN_BOD_LP_ENTRY_VSEL_BITS   _u(0x000001f0)
#define POWMAN_BOD_LP_ENTRY_VSEL_MSB    _u(8)
#define POWMAN_BOD_LP_ENTRY_VSEL_LSB    _u(4)
#define POWMAN_BOD_LP_ENTRY_VSEL_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : POWMAN_BOD_LP_ENTRY_EN
// Description : enable brown-out detection
//               0=not enabled, 1=enabled
#define POWMAN_BOD_LP_ENTRY_EN_RESET  _u(0x0)
#define POWMAN_BOD_LP_ENTRY_EN_BITS   _u(0x00000001)
#define POWMAN_BOD_LP_ENTRY_EN_MSB    _u(0)
#define POWMAN_BOD_LP_ENTRY_EN_LSB    _u(0)
#define POWMAN_BOD_LP_ENTRY_EN_ACCESS "RW"
// =============================================================================
// Register    : POWMAN_BOD_LP_EXIT
// Description : Brown-out Detection Low Power Exit Settings
#define POWMAN_BOD_LP_EXIT_OFFSET _u(0x00000024)
#define POWMAN_BOD_LP_EXIT_BITS   _u(0x000001f1)
#define POWMAN_BOD_LP_EXIT_RESET  _u(0x000000b1)
// -----------------------------------------------------------------------------
// Field       : POWMAN_BOD_LP_EXIT_VSEL
// Description : threshold select
//               00000 - 0.473V
//               00001 - 0.516V
//               00010 - 0.559V
//               00011 - 0.602V
//               00100 - 0.645VS
//               00101 - 0.688V
//               00110 - 0.731V
//               00111 - 0.774V
//               01000 - 0.817V
//               01001 - 0.860V (default)
//               01010 - 0.903V
//               01011 - 0.946V
//               01100 - 0.989V
//               01101 - 1.032V
//               01110 - 1.075V
//               01111 - 1.118V
//               10000 - 1.161
//               10001 - 1.204V
#define POWMAN_BOD_LP_EXIT_VSEL_RESET  _u(0x0b)
#define POWMAN_BOD_LP_EXIT_VSEL_BITS   _u(0x000001f0)
#define POWMAN_BOD_LP_EXIT_VSEL_MSB    _u(8)
#define POWMAN_BOD_LP_EXIT_VSEL_LSB    _u(4)
#define POWMAN_BOD_LP_EXIT_VSEL_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : POWMAN_BOD_LP_EXIT_EN
// Description : enable brown-out detection
//               0=not enabled, 1=enabled
#define POWMAN_BOD_LP_EXIT_EN_RESET  _u(0x1)
#define POWMAN_BOD_LP_EXIT_EN_BITS   _u(0x00000001)
#define POWMAN_BOD_LP_EXIT_EN_MSB    _u(0)
#define POWMAN_BOD_LP_EXIT_EN_LSB    _u(0)
#define POWMAN_BOD_LP_EXIT_EN_ACCESS "RW"
// =============================================================================
// Register    : POWMAN_LPOSC
// Description : Low power oscillator control register.
#define POWMAN_LPOSC_OFFSET _u(0x00000028)
#define POWMAN_LPOSC_BITS   _u(0x000003f3)
#define POWMAN_LPOSC_RESET  _u(0x00000203)
// -----------------------------------------------------------------------------
// Field       : POWMAN_LPOSC_TRIM
// Description : Frequency trim - the trim step is typically 1% of the reset
//               frequency, but can be up to 3%
#define POWMAN_LPOSC_TRIM_RESET  _u(0x20)
#define POWMAN_LPOSC_TRIM_BITS   _u(0x000003f0)
#define POWMAN_LPOSC_TRIM_MSB    _u(9)
#define POWMAN_LPOSC_TRIM_LSB    _u(4)
#define POWMAN_LPOSC_TRIM_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : POWMAN_LPOSC_MODE
// Description : This feature has been removed
#define POWMAN_LPOSC_MODE_RESET  _u(0x3)
#define POWMAN_LPOSC_MODE_BITS   _u(0x00000003)
#define POWMAN_LPOSC_MODE_MSB    _u(1)
#define POWMAN_LPOSC_MODE_LSB    _u(0)
#define POWMAN_LPOSC_MODE_ACCESS "RW"
// =============================================================================
// Register    : POWMAN_CHIP_RESET
// Description : Chip reset control and status
#define POWMAN_CHIP_RESET_OFFSET _u(0x0000002c)
#define POWMAN_CHIP_RESET_BITS   _u(0x1fef0011)
#define POWMAN_CHIP_RESET_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : POWMAN_CHIP_RESET_HAD_WATCHDOG_RESET_RSM
// Description : Last reset was a watchdog timeout which was configured to reset
//               the power-on state machine
//               This resets:
//               double_tap flag    no
//               DP                 no
//               RPAP               no
//               rescue_flag        no
//               timer              no
//               powman             no
//               swcore             no
//               psm                yes
//               and does not change the power state
#define POWMAN_CHIP_RESET_HAD_WATCHDOG_RESET_RSM_RESET  _u(0x0)
#define POWMAN_CHIP_RESET_HAD_WATCHDOG_RESET_RSM_BITS   _u(0x10000000)
#define POWMAN_CHIP_RESET_HAD_WATCHDOG_RESET_RSM_MSB    _u(28)
#define POWMAN_CHIP_RESET_HAD_WATCHDOG_RESET_RSM_LSB    _u(28)
#define POWMAN_CHIP_RESET_HAD_WATCHDOG_RESET_RSM_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : POWMAN_CHIP_RESET_HAD_HZD_SYS_RESET_REQ
// Description : Last reset was a system reset from the hazard debugger
//               This resets:
//               double_tap flag    no
//               DP                 no
//               RPAP               no
//               rescue_flag        no
//               timer              no
//               powman             no
//               swcore             no
//               psm                yes
//               and does not change the power state
#define POWMAN_CHIP_RESET_HAD_HZD_SYS_RESET_REQ_RESET  _u(0x0)
#define POWMAN_CHIP_RESET_HAD_HZD_SYS_RESET_REQ_BITS   _u(0x08000000)
#define POWMAN_CHIP_RESET_HAD_HZD_SYS_RESET_REQ_MSB    _u(27)
#define POWMAN_CHIP_RESET_HAD_HZD_SYS_RESET_REQ_LSB    _u(27)
#define POWMAN_CHIP_RESET_HAD_HZD_SYS_RESET_REQ_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : POWMAN_CHIP_RESET_HAD_GLITCH_DETECT
// Description : Last reset was due to a power supply glitch
//               This resets:
//               double_tap flag    no
//               DP                 no
//               RPAP               no
//               rescue_flag        no
//               timer              no
//               powman             no
