Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/powman.h
//               swcore             no
//               psm                yes
//               and does not change the power state
#define POWMAN_CHIP_RESET_HAD_GLITCH_DETECT_RESET  _u(0x0)
#define POWMAN_CHIP_RESET_HAD_GLITCH_DETECT_BITS   _u(0x04000000)
#define POWMAN_CHIP_RESET_HAD_GLITCH_DETECT_MSB    _u(26)
#define POWMAN_CHIP_RESET_HAD_GLITCH_DETECT_LSB    _u(26)
#define POWMAN_CHIP_RESET_HAD_GLITCH_DETECT_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : POWMAN_CHIP_RESET_HAD_SWCORE_PD
// Description : Last reset was a switched core powerdown
//               This resets:
//               double_tap flag    no
//               DP                 no
//               RPAP               no
//               rescue_flag        no
//               timer              no
//               powman             no
//               swcore             yes
//               psm                yes
//               then starts the power sequencer
#define POWMAN_CHIP_RESET_HAD_SWCORE_PD_RESET  _u(0x0)
#define POWMAN_CHIP_RESET_HAD_SWCORE_PD_BITS   _u(0x02000000)
#define POWMAN_CHIP_RESET_HAD_SWCORE_PD_MSB    _u(25)
#define POWMAN_CHIP_RESET_HAD_SWCORE_PD_LSB    _u(25)
#define POWMAN_CHIP_RESET_HAD_SWCORE_PD_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : POWMAN_CHIP_RESET_HAD_WATCHDOG_RESET_SWCORE
// Description : Last reset was a watchdog timeout which was configured to reset
//               the switched-core
//               This resets:
//               double_tap flag    no
//               DP                 no
//               RPAP               no
//               rescue_flag        no
//               timer              no
//               powman             no
//               swcore             yes
//               psm                yes
//               then starts the power sequencer
#define POWMAN_CHIP_RESET_HAD_WATCHDOG_RESET_SWCORE_RESET  _u(0x0)
#define POWMAN_CHIP_RESET_HAD_WATCHDOG_RESET_SWCORE_BITS   _u(0x01000000)
#define POWMAN_CHIP_RESET_HAD_WATCHDOG_RESET_SWCORE_MSB    _u(24)
#define POWMAN_CHIP_RESET_HAD_WATCHDOG_RESET_SWCORE_LSB    _u(24)
#define POWMAN_CHIP_RESET_HAD_WATCHDOG_RESET_SWCORE_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : POWMAN_CHIP_RESET_HAD_WATCHDOG_RESET_POWMAN
// Description : Last reset was a watchdog timeout which was configured to reset
//               the power manager
//               This resets:
//               double_tap flag    no
//               DP                 no
//               RPAP               no
//               rescue_flag        no
//               timer              yes
//               powman             yes
//               swcore             yes
//               psm                yes
//               then starts the power sequencer
#define POWMAN_CHIP_RESET_HAD_WATCHDOG_RESET_POWMAN_RESET  _u(0x0)
#define POWMAN_CHIP_RESET_HAD_WATCHDOG_RESET_POWMAN_BITS   _u(0x00800000)
#define POWMAN_CHIP_RESET_HAD_WATCHDOG_RESET_POWMAN_MSB    _u(23)
#define POWMAN_CHIP_RESET_HAD_WATCHDOG_RESET_POWMAN_LSB    _u(23)
#define POWMAN_CHIP_RESET_HAD_WATCHDOG_RESET_POWMAN_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : POWMAN_CHIP_RESET_HAD_WATCHDOG_RESET_POWMAN_ASYNC
// Description : Last reset was a watchdog timeout which was configured to reset
//               the power manager asynchronously
//               This resets:
//               double_tap flag    no
//               DP                 no
//               RPAP               no
//               rescue_flag        no
//               timer              yes
//               powman             yes
//               swcore             yes
//               psm                yes
//               then starts the power sequencer
#define POWMAN_CHIP_RESET_HAD_WATCHDOG_RESET_POWMAN_ASYNC_RESET  _u(0x0)
#define POWMAN_CHIP_RESET_HAD_WATCHDOG_RESET_POWMAN_ASYNC_BITS   _u(0x00400000)
#define POWMAN_CHIP_RESET_HAD_WATCHDOG_RESET_POWMAN_ASYNC_MSB    _u(22)
#define POWMAN_CHIP_RESET_HAD_WATCHDOG_RESET_POWMAN_ASYNC_LSB    _u(22)
#define POWMAN_CHIP_RESET_HAD_WATCHDOG_RESET_POWMAN_ASYNC_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : POWMAN_CHIP_RESET_HAD_RESCUE
// Description : Last reset was a rescue reset from the debugger
//               This resets:
//               double_tap flag    no
//               DP                 no
//               RPAP               no
//               rescue_flag        no, it sets this flag
//               timer              yes
//               powman             yes
//               swcore             yes
//               psm                yes
//               then starts the power sequencer
#define POWMAN_CHIP_RESET_HAD_RESCUE_RESET  _u(0x0)
#define POWMAN_CHIP_RESET_HAD_RESCUE_BITS   _u(0x00200000)
#define POWMAN_CHIP_RESET_HAD_RESCUE_MSB    _u(21)
#define POWMAN_CHIP_RESET_HAD_RESCUE_LSB    _u(21)
#define POWMAN_CHIP_RESET_HAD_RESCUE_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : POWMAN_CHIP_RESET_HAD_DP_RESET_REQ
// Description : Last reset was an reset request from the arm debugger
//               This resets:
//               double_tap flag    no
//               DP                 no
//               RPAP               no
//               rescue_flag        yes
//               timer              yes
//               powman             yes
//               swcore             yes
//               psm                yes
//               then starts the power sequencer
#define POWMAN_CHIP_RESET_HAD_DP_RESET_REQ_RESET  _u(0x0)
#define POWMAN_CHIP_RESET_HAD_DP_RESET_REQ_BITS   _u(0x00080000)
#define POWMAN_CHIP_RESET_HAD_DP_RESET_REQ_MSB    _u(19)
#define POWMAN_CHIP_RESET_HAD_DP_RESET_REQ_LSB    _u(19)
#define POWMAN_CHIP_RESET_HAD_DP_RESET_REQ_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : POWMAN_CHIP_RESET_HAD_RUN_LOW
// Description : Last reset was from the RUN pin
//               This resets:
//               double_tap flag    no
//               DP                 yes
//               RPAP               yes
//               rescue_flag        yes
//               timer              yes
//               powman             yes
//               swcore             yes
//               psm                yes
//               then starts the power sequencer
#define POWMAN_CHIP_RESET_HAD_RUN_LOW_RESET  _u(0x0)
#define POWMAN_CHIP_RESET_HAD_RUN_LOW_BITS   _u(0x00040000)
#define POWMAN_CHIP_RESET_HAD_RUN_LOW_MSB    _u(18)
#define POWMAN_CHIP_RESET_HAD_RUN_LOW_LSB    _u(18)
#define POWMAN_CHIP_RESET_HAD_RUN_LOW_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : POWMAN_CHIP_RESET_HAD_BOR
// Description : Last reset was from the brown-out detection block
//               This resets:
//               double_tap flag    yes
//               DP                 yes
//               RPAP               yes
//               rescue_flag        yes
//               timer              yes
//               powman             yes
//               swcore             yes
//               psm                yes
//               then starts the power sequencer
#define POWMAN_CHIP_RESET_HAD_BOR_RESET  _u(0x0)
#define POWMAN_CHIP_RESET_HAD_BOR_BITS   _u(0x00020000)
#define POWMAN_CHIP_RESET_HAD_BOR_MSB    _u(17)
#define POWMAN_CHIP_RESET_HAD_BOR_LSB    _u(17)
#define POWMAN_CHIP_RESET_HAD_BOR_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : POWMAN_CHIP_RESET_HAD_POR
// Description : Last reset was from the power-on reset
//               This resets:
//               double_tap flag    yes
//               DP                 yes
//               RPAP               yes
//               rescue_flag        yes
//               timer              yes
//               powman             yes
//               swcore             yes
//               psm                yes
//               then starts the power sequencer
#define POWMAN_CHIP_RESET_HAD_POR_RESET  _u(0x0)
#define POWMAN_CHIP_RESET_HAD_POR_BITS   _u(0x00010000)
#define POWMAN_CHIP_RESET_HAD_POR_MSB    _u(16)
#define POWMAN_CHIP_RESET_HAD_POR_LSB    _u(16)
#define POWMAN_CHIP_RESET_HAD_POR_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : POWMAN_CHIP_RESET_RESCUE_FLAG
// Description : This is set by a rescue reset from the RP-AP.
//               Its purpose is to halt before the bootrom before booting from
//               flash in order to recover from a boot lock-up.
//               The debugger can then attach once the bootrom has been halted
//               and flash some working code that does not lock up.
#define POWMAN_CHIP_RESET_RESCUE_FLAG_RESET  _u(0x0)
#define POWMAN_CHIP_RESET_RESCUE_FLAG_BITS   _u(0x00000010)
#define POWMAN_CHIP_RESET_RESCUE_FLAG_MSB    _u(4)
#define POWMAN_CHIP_RESET_RESCUE_FLAG_LSB    _u(4)
#define POWMAN_CHIP_RESET_RESCUE_FLAG_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : POWMAN_CHIP_RESET_DOUBLE_TAP
// Description : This flag is set by double-tapping RUN. It tells bootcode to go
//               into the bootloader.
#define POWMAN_CHIP_RESET_DOUBLE_TAP_RESET  _u(0x0)
#define POWMAN_CHIP_RESET_DOUBLE_TAP_BITS   _u(0x00000001)
#define POWMAN_CHIP_RESET_DOUBLE_TAP_MSB    _u(0)
#define POWMAN_CHIP_RESET_DOUBLE_TAP_LSB    _u(0)
#define POWMAN_CHIP_RESET_DOUBLE_TAP_ACCESS "RW"
// =============================================================================
// Register    : POWMAN_WDSEL
// Description : Allows a watchdog reset to reset the internal state of powman
//               in addition to the power-on state machine (PSM).
//               Note that powman ignores watchdog resets that do not select at
//               least the CLOCKS stage or earlier stages in the PSM. If using
//               these bits, it's recommended to set PSM_WDSEL to all-ones in
//               addition to the desired bits in this register. Failing to
//               select CLOCKS or earlier will result in the POWMAN_WDSEL
//               register having no effect.
#define POWMAN_WDSEL_OFFSET _u(0x00000030)
#define POWMAN_WDSEL_BITS   _u(0x00001111)
#define POWMAN_WDSEL_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : POWMAN_WDSEL_RESET_RSM
// Description : If set to 1, a watchdog reset will run the full power-on state
//               machine (PSM) sequence
//               From a user perspective it is the same as setting
//               RSM_WDSEL_PROC_COLD
//               From a hardware debug perspective it has the same effect as a
//               reset from a glitch detector
#define POWMAN_WDSEL_RESET_RSM_RESET  _u(0x0)
#define POWMAN_WDSEL_RESET_RSM_BITS   _u(0x00001000)
#define POWMAN_WDSEL_RESET_RSM_MSB    _u(12)
#define POWMAN_WDSEL_RESET_RSM_LSB    _u(12)
#define POWMAN_WDSEL_RESET_RSM_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : POWMAN_WDSEL_RESET_SWCORE
// Description : If set to 1, a watchdog reset will reset the switched core
//               power domain and run the full power-on state machine (PSM)
//               sequence
//               From a user perspective it is the same as setting
//               RSM_WDSEL_PROC_COLD
//               From a hardware debug perspective it has the same effect as a
//               power-on reset for the switched core power domain
#define POWMAN_WDSEL_RESET_SWCORE_RESET  _u(0x0)
#define POWMAN_WDSEL_RESET_SWCORE_BITS   _u(0x00000100)
#define POWMAN_WDSEL_RESET_SWCORE_MSB    _u(8)
#define POWMAN_WDSEL_RESET_SWCORE_LSB    _u(8)
#define POWMAN_WDSEL_RESET_SWCORE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : POWMAN_WDSEL_RESET_POWMAN
// Description : If set to 1, a watchdog reset will restore powman defaults,
//               reset the timer, reset the switched core power domain
//               and run the full power-on state machine (PSM) sequence
//               This relies on clk_ref running. Use reset_powman_async if that
//               may not be true
#define POWMAN_WDSEL_RESET_POWMAN_RESET  _u(0x0)
#define POWMAN_WDSEL_RESET_POWMAN_BITS   _u(0x00000010)
#define POWMAN_WDSEL_RESET_POWMAN_MSB    _u(4)
#define POWMAN_WDSEL_RESET_POWMAN_LSB    _u(4)
#define POWMAN_WDSEL_RESET_POWMAN_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : POWMAN_WDSEL_RESET_POWMAN_ASYNC
// Description : If set to 1, a watchdog reset will restore powman defaults,
//               reset the timer,
//               reset the switched core domain and run the full power-on state
//               machine (PSM) sequence
//               This does not rely on clk_ref running
#define POWMAN_WDSEL_RESET_POWMAN_ASYNC_RESET  _u(0x0)
#define POWMAN_WDSEL_RESET_POWMAN_ASYNC_BITS   _u(0x00000001)
#define POWMAN_WDSEL_RESET_POWMAN_ASYNC_MSB    _u(0)
#define POWMAN_WDSEL_RESET_POWMAN_ASYNC_LSB    _u(0)
#define POWMAN_WDSEL_RESET_POWMAN_ASYNC_ACCESS "RW"
// =============================================================================
// Register    : POWMAN_SEQ_CFG
// Description : For configuration of the power sequencer
//               Writes are ignored while POWMAN_STATE_CHANGING=1
#define POWMAN_SEQ_CFG_OFFSET _u(0x00000034)
#define POWMAN_SEQ_CFG_BITS   _u(0x001311f3)
#define POWMAN_SEQ_CFG_RESET  _u(0x001011f0)
// -----------------------------------------------------------------------------
// Field       : POWMAN_SEQ_CFG_USING_FAST_POWCK
// Description : 0 indicates the POWMAN clock is running from the low power
//               oscillator (32kHz)
//               1 indicates the POWMAN clock is running from the reference
//               clock (2-50MHz)
#define POWMAN_SEQ_CFG_USING_FAST_POWCK_RESET  _u(0x1)
#define POWMAN_SEQ_CFG_USING_FAST_POWCK_BITS   _u(0x00100000)
#define POWMAN_SEQ_CFG_USING_FAST_POWCK_MSB    _u(20)
#define POWMAN_SEQ_CFG_USING_FAST_POWCK_LSB    _u(20)
#define POWMAN_SEQ_CFG_USING_FAST_POWCK_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : POWMAN_SEQ_CFG_USING_BOD_LP
// Description : Indicates the brown-out detector (BOD) mode
//               0 = BOD high power mode which is the default
//               1 = BOD low power mode
#define POWMAN_SEQ_CFG_USING_BOD_LP_RESET  _u(0x0)
#define POWMAN_SEQ_CFG_USING_BOD_LP_BITS   _u(0x00020000)
#define POWMAN_SEQ_CFG_USING_BOD_LP_MSB    _u(17)
#define POWMAN_SEQ_CFG_USING_BOD_LP_LSB    _u(17)
#define POWMAN_SEQ_CFG_USING_BOD_LP_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : POWMAN_SEQ_CFG_USING_VREG_LP
// Description : Indicates the voltage regulator (VREG) mode
//               0 = VREG high power mode which is the default
//               1 = VREG low power mode
#define POWMAN_SEQ_CFG_USING_VREG_LP_RESET  _u(0x0)
#define POWMAN_SEQ_CFG_USING_VREG_LP_BITS   _u(0x00010000)
#define POWMAN_SEQ_CFG_USING_VREG_LP_MSB    _u(16)
#define POWMAN_SEQ_CFG_USING_VREG_LP_LSB    _u(16)
#define POWMAN_SEQ_CFG_USING_VREG_LP_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : POWMAN_SEQ_CFG_USE_FAST_POWCK
// Description : selects the reference clock (clk_ref) as the source of the
//               POWMAN clock when switched-core is powered. The POWMAN clock
//               always switches to the slow clock (lposc) when switched-core is
//               powered down because the fast clock stops running.
//               0 always run the POWMAN clock from the slow clock (lposc)
//               1 run the POWMAN clock from the fast clock when available
//               This setting takes effect when a power up sequence is next run
#define POWMAN_SEQ_CFG_USE_FAST_POWCK_RESET  _u(0x1)
#define POWMAN_SEQ_CFG_USE_FAST_POWCK_BITS   _u(0x00001000)
#define POWMAN_SEQ_CFG_USE_FAST_POWCK_MSB    _u(12)
#define POWMAN_SEQ_CFG_USE_FAST_POWCK_LSB    _u(12)
#define POWMAN_SEQ_CFG_USE_FAST_POWCK_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : POWMAN_SEQ_CFG_RUN_LPOSC_IN_LP
// Description : Set to 0 to stop the low power osc when the switched-core is
//               powered down, which is unwise if using it to clock the timer
//               This setting takes effect when the swcore is next powered down
#define POWMAN_SEQ_CFG_RUN_LPOSC_IN_LP_RESET  _u(0x1)
#define POWMAN_SEQ_CFG_RUN_LPOSC_IN_LP_BITS   _u(0x00000100)
#define POWMAN_SEQ_CFG_RUN_LPOSC_IN_LP_MSB    _u(8)
#define POWMAN_SEQ_CFG_RUN_LPOSC_IN_LP_LSB    _u(8)
#define POWMAN_SEQ_CFG_RUN_LPOSC_IN_LP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : POWMAN_SEQ_CFG_USE_BOD_HP
// Description : Set to 0 to prevent automatic switching to bod high power mode
//               when switched-core is powered up
//               This setting takes effect when the swcore is next powered up
#define POWMAN_SEQ_CFG_USE_BOD_HP_RESET  _u(0x1)
#define POWMAN_SEQ_CFG_USE_BOD_HP_BITS   _u(0x00000080)
#define POWMAN_SEQ_CFG_USE_BOD_HP_MSB    _u(7)
#define POWMAN_SEQ_CFG_USE_BOD_HP_LSB    _u(7)
#define POWMAN_SEQ_CFG_USE_BOD_HP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : POWMAN_SEQ_CFG_USE_BOD_LP
// Description : Set to 0 to prevent automatic switching to bod low power mode
//               when switched-core is powered down
//               This setting takes effect when the swcore is next powered down
#define POWMAN_SEQ_CFG_USE_BOD_LP_RESET  _u(0x1)
#define POWMAN_SEQ_CFG_USE_BOD_LP_BITS   _u(0x00000040)
#define POWMAN_SEQ_CFG_USE_BOD_LP_MSB    _u(6)
#define POWMAN_SEQ_CFG_USE_BOD_LP_LSB    _u(6)
#define POWMAN_SEQ_CFG_USE_BOD_LP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : POWMAN_SEQ_CFG_USE_VREG_HP
// Description : Set to 0 to prevent automatic switching to vreg high power mode
//               when switched-core is powered up
//               This setting takes effect when the swcore is next powered up
#define POWMAN_SEQ_CFG_USE_VREG_HP_RESET  _u(0x1)
#define POWMAN_SEQ_CFG_USE_VREG_HP_BITS   _u(0x00000020)
#define POWMAN_SEQ_CFG_USE_VREG_HP_MSB    _u(5)
#define POWMAN_SEQ_CFG_USE_VREG_HP_LSB    _u(5)
#define POWMAN_SEQ_CFG_USE_VREG_HP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : POWMAN_SEQ_CFG_USE_VREG_LP
// Description : Set to 0 to prevent automatic switching to vreg low power mode
//               when switched-core is powered down
//               This setting takes effect when the swcore is next powered down
#define POWMAN_SEQ_CFG_USE_VREG_LP_RESET  _u(0x1)
#define POWMAN_SEQ_CFG_USE_VREG_LP_BITS   _u(0x00000010)
#define POWMAN_SEQ_CFG_USE_VREG_LP_MSB    _u(4)
#define POWMAN_SEQ_CFG_USE_VREG_LP_LSB    _u(4)
#define POWMAN_SEQ_CFG_USE_VREG_LP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : POWMAN_SEQ_CFG_HW_PWRUP_SRAM0
// Description : Specifies the power state of SRAM0 when powering up swcore from
//               a low power state (P1.xxx) to a high power state (P0.0xx).
//               0=power-up
//               1=no change
#define POWMAN_SEQ_CFG_HW_PWRUP_SRAM0_RESET  _u(0x0)
#define POWMAN_SEQ_CFG_HW_PWRUP_SRAM0_BITS   _u(0x00000002)
#define POWMAN_SEQ_CFG_HW_PWRUP_SRAM0_MSB    _u(1)
#define POWMAN_SEQ_CFG_HW_PWRUP_SRAM0_LSB    _u(1)
#define POWMAN_SEQ_CFG_HW_PWRUP_SRAM0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : POWMAN_SEQ_CFG_HW_PWRUP_SRAM1
// Description : Specifies the power state of SRAM1 when powering up swcore from
//               a low power state (P1.xxx) to a high power state (P0.0xx).
//               0=power-up
//               1=no change
#define POWMAN_SEQ_CFG_HW_PWRUP_SRAM1_RESET  _u(0x0)
#define POWMAN_SEQ_CFG_HW_PWRUP_SRAM1_BITS   _u(0x00000001)
#define POWMAN_SEQ_CFG_HW_PWRUP_SRAM1_MSB    _u(0)
#define POWMAN_SEQ_CFG_HW_PWRUP_SRAM1_LSB    _u(0)
#define POWMAN_SEQ_CFG_HW_PWRUP_SRAM1_ACCESS "RW"
// =============================================================================
// Register    : POWMAN_STATE
// Description : This register controls the power state of the 4 power domains.
//               The current power state is indicated in POWMAN_STATE_CURRENT
//               which is read-only.
//               To change the state, write to POWMAN_STATE_REQ.
//               The coding of POWMAN_STATE_CURRENT & POWMAN_STATE_REQ
//               corresponds to the power states
//               defined in the datasheet:
//               bit 3 = SWCORE
//               bit 2 = XIP cache
//               bit 1 = SRAM0
//               bit 0 = SRAM1
//               0 = powered up
//               1 = powered down
//               When POWMAN_STATE_REQ is written, the POWMAN_STATE_WAITING flag
//               is set while the Power Manager determines what is required. If
//               an invalid transition is requested the Power Manager will still
//               register the request in POWMAN_STATE_REQ but will also set the
//               POWMAN_BAD_REQ flag. It will then implement the power-up
//               requests and ignore the power down requests. To do nothing
//               would risk entering an unrecoverable lock-up state. Invalid
//               requests are: any combination of power up and power down
//               requests any request that results in swcore being powered and
//               xip unpowered If the request is to power down the switched-core
//               domain then POWMAN_STATE_WAITING stays active until the
//               processors halt. During this time the POWMAN_STATE_REQ field
//               can be re-written to change or cancel the request. When the
//               power state transition begins the POWMAN_STATE_WAITING_flag is
//               cleared, the POWMAN_STATE_CHANGING flag is set and POWMAN
//               register writes are ignored until the transition completes.
#define POWMAN_STATE_OFFSET _u(0x00000038)
#define POWMAN_STATE_BITS   _u(0x00003fff)
#define POWMAN_STATE_RESET  _u(0x0000000f)
// -----------------------------------------------------------------------------
// Field       : POWMAN_STATE_CHANGING
// Description : Indicates a power state change is in progress
#define POWMAN_STATE_CHANGING_RESET  _u(0x0)
#define POWMAN_STATE_CHANGING_BITS   _u(0x00002000)
#define POWMAN_STATE_CHANGING_MSB    _u(13)
#define POWMAN_STATE_CHANGING_LSB    _u(13)
#define POWMAN_STATE_CHANGING_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : POWMAN_STATE_WAITING
// Description : Indicates the power manager has received a state change request
//               and is waiting for other actions to complete before executing
//               it
#define POWMAN_STATE_WAITING_RESET  _u(0x0)
#define POWMAN_STATE_WAITING_BITS   _u(0x00001000)
#define POWMAN_STATE_WAITING_MSB    _u(12)
#define POWMAN_STATE_WAITING_LSB    _u(12)
#define POWMAN_STATE_WAITING_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : POWMAN_STATE_BAD_HW_REQ
// Description : Invalid hardware initiated state request, power up requests
