Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/powman.h
//               actioned, power down requests ignored
#define POWMAN_STATE_BAD_HW_REQ_RESET  _u(0x0)
#define POWMAN_STATE_BAD_HW_REQ_BITS   _u(0x00000800)
#define POWMAN_STATE_BAD_HW_REQ_MSB    _u(11)
#define POWMAN_STATE_BAD_HW_REQ_LSB    _u(11)
#define POWMAN_STATE_BAD_HW_REQ_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : POWMAN_STATE_BAD_SW_REQ
// Description : Invalid software initiated state request ignored
#define POWMAN_STATE_BAD_SW_REQ_RESET  _u(0x0)
#define POWMAN_STATE_BAD_SW_REQ_BITS   _u(0x00000400)
#define POWMAN_STATE_BAD_SW_REQ_MSB    _u(10)
#define POWMAN_STATE_BAD_SW_REQ_LSB    _u(10)
#define POWMAN_STATE_BAD_SW_REQ_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : POWMAN_STATE_PWRUP_WHILE_WAITING
// Description : Indicates that a power state change request was ignored because
//               of a pending power state change request
#define POWMAN_STATE_PWRUP_WHILE_WAITING_RESET  _u(0x0)
#define POWMAN_STATE_PWRUP_WHILE_WAITING_BITS   _u(0x00000200)
#define POWMAN_STATE_PWRUP_WHILE_WAITING_MSB    _u(9)
#define POWMAN_STATE_PWRUP_WHILE_WAITING_LSB    _u(9)
#define POWMAN_STATE_PWRUP_WHILE_WAITING_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : POWMAN_STATE_REQ_IGNORED
// Description : Indicates that a software state change request was ignored
//               because it clashed with an ongoing hardware or debugger request
#define POWMAN_STATE_REQ_IGNORED_RESET  _u(0x0)
#define POWMAN_STATE_REQ_IGNORED_BITS   _u(0x00000100)
#define POWMAN_STATE_REQ_IGNORED_MSB    _u(8)
#define POWMAN_STATE_REQ_IGNORED_LSB    _u(8)
#define POWMAN_STATE_REQ_IGNORED_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : POWMAN_STATE_REQ
// Description : This is written by software or hardware to request a new power
//               state
#define POWMAN_STATE_REQ_RESET  _u(0x0)
#define POWMAN_STATE_REQ_BITS   _u(0x000000f0)
#define POWMAN_STATE_REQ_MSB    _u(7)
#define POWMAN_STATE_REQ_LSB    _u(4)
#define POWMAN_STATE_REQ_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : POWMAN_STATE_CURRENT
// Description : Indicates the current power state
#define POWMAN_STATE_CURRENT_RESET  _u(0xf)
#define POWMAN_STATE_CURRENT_BITS   _u(0x0000000f)
#define POWMAN_STATE_CURRENT_MSB    _u(3)
#define POWMAN_STATE_CURRENT_LSB    _u(0)
#define POWMAN_STATE_CURRENT_ACCESS "RO"
// =============================================================================
// Register    : POWMAN_POW_FASTDIV
// Description : divides the POWMAN clock to provide a tick for the delay module
//               and state machines
//               when clk_pow is running from the slow clock it is not divided
//               when clk_pow is running from the fast clock it is divided by
//               tick_div
#define POWMAN_POW_FASTDIV_OFFSET _u(0x0000003c)
#define POWMAN_POW_FASTDIV_BITS   _u(0x000007ff)
#define POWMAN_POW_FASTDIV_RESET  _u(0x00000040)
#define POWMAN_POW_FASTDIV_MSB    _u(10)
#define POWMAN_POW_FASTDIV_LSB    _u(0)
#define POWMAN_POW_FASTDIV_ACCESS "RW"
// =============================================================================
// Register    : POWMAN_POW_DELAY
// Description : power state machine delays
#define POWMAN_POW_DELAY_OFFSET _u(0x00000040)
#define POWMAN_POW_DELAY_BITS   _u(0x0000ffff)
#define POWMAN_POW_DELAY_RESET  _u(0x00002011)
// -----------------------------------------------------------------------------
// Field       : POWMAN_POW_DELAY_SRAM_STEP
// Description : timing between the sram0 and sram1 power state machine steps
//               measured in units of the powman tick period (>=1us), 0 gives a
//               delay of 1 unit
#define POWMAN_POW_DELAY_SRAM_STEP_RESET  _u(0x20)
#define POWMAN_POW_DELAY_SRAM_STEP_BITS   _u(0x0000ff00)
#define POWMAN_POW_DELAY_SRAM_STEP_MSB    _u(15)
#define POWMAN_POW_DELAY_SRAM_STEP_LSB    _u(8)
#define POWMAN_POW_DELAY_SRAM_STEP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : POWMAN_POW_DELAY_XIP_STEP
// Description : timing between the xip power state machine steps
//               measured in units of the lposc period, 0 gives a delay of 1
//               unit
#define POWMAN_POW_DELAY_XIP_STEP_RESET  _u(0x1)
#define POWMAN_POW_DELAY_XIP_STEP_BITS   _u(0x000000f0)
#define POWMAN_POW_DELAY_XIP_STEP_MSB    _u(7)
#define POWMAN_POW_DELAY_XIP_STEP_LSB    _u(4)
#define POWMAN_POW_DELAY_XIP_STEP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : POWMAN_POW_DELAY_SWCORE_STEP
// Description : timing between the swcore power state machine steps
//               measured in units of the lposc period, 0 gives a delay of 1
//               unit
#define POWMAN_POW_DELAY_SWCORE_STEP_RESET  _u(0x1)
#define POWMAN_POW_DELAY_SWCORE_STEP_BITS   _u(0x0000000f)
#define POWMAN_POW_DELAY_SWCORE_STEP_MSB    _u(3)
#define POWMAN_POW_DELAY_SWCORE_STEP_LSB    _u(0)
#define POWMAN_POW_DELAY_SWCORE_STEP_ACCESS "RW"
// =============================================================================
// Register    : POWMAN_EXT_CTRL0
// Description : Configures a gpio as a power mode aware control output
#define POWMAN_EXT_CTRL0_OFFSET _u(0x00000044)
#define POWMAN_EXT_CTRL0_BITS   _u(0x0000713f)
#define POWMAN_EXT_CTRL0_RESET  _u(0x0000003f)
// -----------------------------------------------------------------------------
// Field       : POWMAN_EXT_CTRL0_LP_EXIT_STATE
// Description : output level when exiting the low power state
#define POWMAN_EXT_CTRL0_LP_EXIT_STATE_RESET  _u(0x0)
#define POWMAN_EXT_CTRL0_LP_EXIT_STATE_BITS   _u(0x00004000)
#define POWMAN_EXT_CTRL0_LP_EXIT_STATE_MSB    _u(14)
#define POWMAN_EXT_CTRL0_LP_EXIT_STATE_LSB    _u(14)
#define POWMAN_EXT_CTRL0_LP_EXIT_STATE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : POWMAN_EXT_CTRL0_LP_ENTRY_STATE
// Description : output level when entering the low power state
#define POWMAN_EXT_CTRL0_LP_ENTRY_STATE_RESET  _u(0x0)
#define POWMAN_EXT_CTRL0_LP_ENTRY_STATE_BITS   _u(0x00002000)
#define POWMAN_EXT_CTRL0_LP_ENTRY_STATE_MSB    _u(13)
#define POWMAN_EXT_CTRL0_LP_ENTRY_STATE_LSB    _u(13)
#define POWMAN_EXT_CTRL0_LP_ENTRY_STATE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : POWMAN_EXT_CTRL0_INIT_STATE
#define POWMAN_EXT_CTRL0_INIT_STATE_RESET  _u(0x0)
#define POWMAN_EXT_CTRL0_INIT_STATE_BITS   _u(0x00001000)
#define POWMAN_EXT_CTRL0_INIT_STATE_MSB    _u(12)
#define POWMAN_EXT_CTRL0_INIT_STATE_LSB    _u(12)
#define POWMAN_EXT_CTRL0_INIT_STATE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : POWMAN_EXT_CTRL0_INIT
#define POWMAN_EXT_CTRL0_INIT_RESET  _u(0x0)
#define POWMAN_EXT_CTRL0_INIT_BITS   _u(0x00000100)
#define POWMAN_EXT_CTRL0_INIT_MSB    _u(8)
#define POWMAN_EXT_CTRL0_INIT_LSB    _u(8)
#define POWMAN_EXT_CTRL0_INIT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : POWMAN_EXT_CTRL0_GPIO_SELECT
// Description : selects from gpio 0->30
//               set to 31 to disable this feature
#define POWMAN_EXT_CTRL0_GPIO_SELECT_RESET  _u(0x3f)
#define POWMAN_EXT_CTRL0_GPIO_SELECT_BITS   _u(0x0000003f)
#define POWMAN_EXT_CTRL0_GPIO_SELECT_MSB    _u(5)
#define POWMAN_EXT_CTRL0_GPIO_SELECT_LSB    _u(0)
#define POWMAN_EXT_CTRL0_GPIO_SELECT_ACCESS "RW"
// =============================================================================
// Register    : POWMAN_EXT_CTRL1
// Description : Configures a gpio as a power mode aware control output
#define POWMAN_EXT_CTRL1_OFFSET _u(0x00000048)
#define POWMAN_EXT_CTRL1_BITS   _u(0x0000713f)
#define POWMAN_EXT_CTRL1_RESET  _u(0x0000003f)
// -----------------------------------------------------------------------------
// Field       : POWMAN_EXT_CTRL1_LP_EXIT_STATE
// Description : output level when exiting the low power state
#define POWMAN_EXT_CTRL1_LP_EXIT_STATE_RESET  _u(0x0)
#define POWMAN_EXT_CTRL1_LP_EXIT_STATE_BITS   _u(0x00004000)
#define POWMAN_EXT_CTRL1_LP_EXIT_STATE_MSB    _u(14)
#define POWMAN_EXT_CTRL1_LP_EXIT_STATE_LSB    _u(14)
#define POWMAN_EXT_CTRL1_LP_EXIT_STATE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : POWMAN_EXT_CTRL1_LP_ENTRY_STATE
// Description : output level when entering the low power state
#define POWMAN_EXT_CTRL1_LP_ENTRY_STATE_RESET  _u(0x0)
#define POWMAN_EXT_CTRL1_LP_ENTRY_STATE_BITS   _u(0x00002000)
#define POWMAN_EXT_CTRL1_LP_ENTRY_STATE_MSB    _u(13)
#define POWMAN_EXT_CTRL1_LP_ENTRY_STATE_LSB    _u(13)
#define POWMAN_EXT_CTRL1_LP_ENTRY_STATE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : POWMAN_EXT_CTRL1_INIT_STATE
#define POWMAN_EXT_CTRL1_INIT_STATE_RESET  _u(0x0)
#define POWMAN_EXT_CTRL1_INIT_STATE_BITS   _u(0x00001000)
#define POWMAN_EXT_CTRL1_INIT_STATE_MSB    _u(12)
#define POWMAN_EXT_CTRL1_INIT_STATE_LSB    _u(12)
#define POWMAN_EXT_CTRL1_INIT_STATE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : POWMAN_EXT_CTRL1_INIT
#define POWMAN_EXT_CTRL1_INIT_RESET  _u(0x0)
#define POWMAN_EXT_CTRL1_INIT_BITS   _u(0x00000100)
#define POWMAN_EXT_CTRL1_INIT_MSB    _u(8)
#define POWMAN_EXT_CTRL1_INIT_LSB    _u(8)
#define POWMAN_EXT_CTRL1_INIT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : POWMAN_EXT_CTRL1_GPIO_SELECT
// Description : selects from gpio 0->30
//               set to 31 to disable this feature
#define POWMAN_EXT_CTRL1_GPIO_SELECT_RESET  _u(0x3f)
#define POWMAN_EXT_CTRL1_GPIO_SELECT_BITS   _u(0x0000003f)
#define POWMAN_EXT_CTRL1_GPIO_SELECT_MSB    _u(5)
#define POWMAN_EXT_CTRL1_GPIO_SELECT_LSB    _u(0)
#define POWMAN_EXT_CTRL1_GPIO_SELECT_ACCESS "RW"
// =============================================================================
// Register    : POWMAN_EXT_TIME_REF
// Description : Select a GPIO to use as a time reference, the source can be
//               used to drive the low power clock at 32kHz, or to provide a 1ms
//               tick to the timer, or provide a 1Hz tick to the timer. The tick
//               selection is controlled by the POWMAN_TIMER register.
#define POWMAN_EXT_TIME_REF_OFFSET _u(0x0000004c)
#define POWMAN_EXT_TIME_REF_BITS   _u(0x00000013)
#define POWMAN_EXT_TIME_REF_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : POWMAN_EXT_TIME_REF_DRIVE_LPCK
// Description : Use the selected GPIO to drive the 32kHz low power clock, in
//               place of LPOSC. This field must only be written when
//               POWMAN_TIMER_RUN=0
#define POWMAN_EXT_TIME_REF_DRIVE_LPCK_RESET  _u(0x0)
#define POWMAN_EXT_TIME_REF_DRIVE_LPCK_BITS   _u(0x00000010)
#define POWMAN_EXT_TIME_REF_DRIVE_LPCK_MSB    _u(4)
#define POWMAN_EXT_TIME_REF_DRIVE_LPCK_LSB    _u(4)
#define POWMAN_EXT_TIME_REF_DRIVE_LPCK_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : POWMAN_EXT_TIME_REF_SOURCE_SEL
// Description : 0 ->  gpio12
//               1 ->  gpio20
//               2 ->  gpio14
//               3 ->  gpio22
#define POWMAN_EXT_TIME_REF_SOURCE_SEL_RESET  _u(0x0)
#define POWMAN_EXT_TIME_REF_SOURCE_SEL_BITS   _u(0x00000003)
#define POWMAN_EXT_TIME_REF_SOURCE_SEL_MSB    _u(1)
#define POWMAN_EXT_TIME_REF_SOURCE_SEL_LSB    _u(0)
#define POWMAN_EXT_TIME_REF_SOURCE_SEL_ACCESS "RW"
#define POWMAN_EXT_TIME_REF_SOURCE_SEL_VALUE_GPIO12 _u(0x0)
#define POWMAN_EXT_TIME_REF_SOURCE_SEL_VALUE_GPIO20 _u(0x1)
#define POWMAN_EXT_TIME_REF_SOURCE_SEL_VALUE_GPIO14 _u(0x2)
#define POWMAN_EXT_TIME_REF_SOURCE_SEL_VALUE_GPIO22 _u(0x3)
// =============================================================================
// Register    : POWMAN_LPOSC_FREQ_KHZ_INT
// Description : Informs the AON Timer of the integer component of the clock
//               frequency when running off the LPOSC.
//               Integer component of the LPOSC or GPIO clock source frequency
//               in kHz. Default = 32 This field must only be written when
//               POWMAN_TIMER_RUN=0 or POWMAN_TIMER_USING_XOSC=1
#define POWMAN_LPOSC_FREQ_KHZ_INT_OFFSET _u(0x00000050)
#define POWMAN_LPOSC_FREQ_KHZ_INT_BITS   _u(0x0000003f)
#define POWMAN_LPOSC_FREQ_KHZ_INT_RESET  _u(0x00000020)
#define POWMAN_LPOSC_FREQ_KHZ_INT_MSB    _u(5)
#define POWMAN_LPOSC_FREQ_KHZ_INT_LSB    _u(0)
#define POWMAN_LPOSC_FREQ_KHZ_INT_ACCESS "RW"
// =============================================================================
// Register    : POWMAN_LPOSC_FREQ_KHZ_FRAC
// Description : Informs the AON Timer of the fractional component of the clock
//               frequency when running off the LPOSC.
//               Fractional component of the LPOSC or GPIO clock source
//               frequency in kHz. Default = 0.768 This field must only be
//               written when POWMAN_TIMER_RUN=0 or POWMAN_TIMER_USING_XOSC=1
#define POWMAN_LPOSC_FREQ_KHZ_FRAC_OFFSET _u(0x00000054)
#define POWMAN_LPOSC_FREQ_KHZ_FRAC_BITS   _u(0x0000ffff)
#define POWMAN_LPOSC_FREQ_KHZ_FRAC_RESET  _u(0x0000c49c)
#define POWMAN_LPOSC_FREQ_KHZ_FRAC_MSB    _u(15)
#define POWMAN_LPOSC_FREQ_KHZ_FRAC_LSB    _u(0)
#define POWMAN_LPOSC_FREQ_KHZ_FRAC_ACCESS "RW"
// =============================================================================
// Register    : POWMAN_XOSC_FREQ_KHZ_INT
// Description : Informs the AON Timer of the integer component of the clock
//               frequency when running off the XOSC.
//               Integer component of the XOSC frequency in kHz. Default = 12000
//               Must be >1 This field must only be written when
//               POWMAN_TIMER_RUN=0 or POWMAN_TIMER_USING_XOSC=0
#define POWMAN_XOSC_FREQ_KHZ_INT_OFFSET _u(0x00000058)
#define POWMAN_XOSC_FREQ_KHZ_INT_BITS   _u(0x0000ffff)
#define POWMAN_XOSC_FREQ_KHZ_INT_RESET  _u(0x00002ee0)
#define POWMAN_XOSC_FREQ_KHZ_INT_MSB    _u(15)
#define POWMAN_XOSC_FREQ_KHZ_INT_LSB    _u(0)
#define POWMAN_XOSC_FREQ_KHZ_INT_ACCESS "RW"
// =============================================================================
// Register    : POWMAN_XOSC_FREQ_KHZ_FRAC
// Description : Informs the AON Timer of the fractional component of the clock
//               frequency when running off the XOSC.
//               Fractional component of the XOSC frequency in kHz. This field
//               must only be written when POWMAN_TIMER_RUN=0 or
//               POWMAN_TIMER_USING_XOSC=0
#define POWMAN_XOSC_FREQ_KHZ_FRAC_OFFSET _u(0x0000005c)
#define POWMAN_XOSC_FREQ_KHZ_FRAC_BITS   _u(0x0000ffff)
#define POWMAN_XOSC_FREQ_KHZ_FRAC_RESET  _u(0x00000000)
#define POWMAN_XOSC_FREQ_KHZ_FRAC_MSB    _u(15)
#define POWMAN_XOSC_FREQ_KHZ_FRAC_LSB    _u(0)
#define POWMAN_XOSC_FREQ_KHZ_FRAC_ACCESS "RW"
// =============================================================================
// Register    : POWMAN_SET_TIME_63TO48
// Description : For setting the time, do not use for reading the time, use
//               POWMAN_READ_TIME_UPPER and POWMAN_READ_TIME_LOWER. This field
//               must only be written when POWMAN_TIMER_RUN=0
#define POWMAN_SET_TIME_63TO48_OFFSET _u(0x00000060)
#define POWMAN_SET_TIME_63TO48_BITS   _u(0x0000ffff)
#define POWMAN_SET_TIME_63TO48_RESET  _u(0x00000000)
#define POWMAN_SET_TIME_63TO48_MSB    _u(15)
#define POWMAN_SET_TIME_63TO48_LSB    _u(0)
#define POWMAN_SET_TIME_63TO48_ACCESS "RW"
// =============================================================================
// Register    : POWMAN_SET_TIME_47TO32
// Description : For setting the time, do not use for reading the time, use
//               POWMAN_READ_TIME_UPPER and POWMAN_READ_TIME_LOWER. This field
//               must only be written when POWMAN_TIMER_RUN=0
#define POWMAN_SET_TIME_47TO32_OFFSET _u(0x00000064)
#define POWMAN_SET_TIME_47TO32_BITS   _u(0x0000ffff)
#define POWMAN_SET_TIME_47TO32_RESET  _u(0x00000000)
#define POWMAN_SET_TIME_47TO32_MSB    _u(15)
#define POWMAN_SET_TIME_47TO32_LSB    _u(0)
#define POWMAN_SET_TIME_47TO32_ACCESS "RW"
// =============================================================================
// Register    : POWMAN_SET_TIME_31TO16
// Description : For setting the time, do not use for reading the time, use
//               POWMAN_READ_TIME_UPPER and POWMAN_READ_TIME_LOWER. This field
//               must only be written when POWMAN_TIMER_RUN=0
#define POWMAN_SET_TIME_31TO16_OFFSET _u(0x00000068)
#define POWMAN_SET_TIME_31TO16_BITS   _u(0x0000ffff)
#define POWMAN_SET_TIME_31TO16_RESET  _u(0x00000000)
#define POWMAN_SET_TIME_31TO16_MSB    _u(15)
#define POWMAN_SET_TIME_31TO16_LSB    _u(0)
#define POWMAN_SET_TIME_31TO16_ACCESS "RW"
// =============================================================================
// Register    : POWMAN_SET_TIME_15TO0
// Description : For setting the time, do not use for reading the time, use
//               POWMAN_READ_TIME_UPPER and POWMAN_READ_TIME_LOWER. This field
//               must only be written when POWMAN_TIMER_RUN=0
#define POWMAN_SET_TIME_15TO0_OFFSET _u(0x0000006c)
#define POWMAN_SET_TIME_15TO0_BITS   _u(0x0000ffff)
#define POWMAN_SET_TIME_15TO0_RESET  _u(0x00000000)
#define POWMAN_SET_TIME_15TO0_MSB    _u(15)
#define POWMAN_SET_TIME_15TO0_LSB    _u(0)
#define POWMAN_SET_TIME_15TO0_ACCESS "RW"
// =============================================================================
// Register    : POWMAN_READ_TIME_UPPER
// Description : For reading bits 63:32 of the timer. When reading all 64 bits
//               it is possible for the LOWER count to rollover during the read.
//               It is recommended to read UPPER, then LOWER, then re-read UPPER
//               and, if it has changed, re-read LOWER.
#define POWMAN_READ_TIME_UPPER_OFFSET _u(0x00000070)
#define POWMAN_READ_TIME_UPPER_BITS   _u(0xffffffff)
#define POWMAN_READ_TIME_UPPER_RESET  _u(0x00000000)
#define POWMAN_READ_TIME_UPPER_MSB    _u(31)
#define POWMAN_READ_TIME_UPPER_LSB    _u(0)
#define POWMAN_READ_TIME_UPPER_ACCESS "RO"
// =============================================================================
// Register    : POWMAN_READ_TIME_LOWER
// Description : For reading bits 31:0 of the timer.
#define POWMAN_READ_TIME_LOWER_OFFSET _u(0x00000074)
#define POWMAN_READ_TIME_LOWER_BITS   _u(0xffffffff)
#define POWMAN_READ_TIME_LOWER_RESET  _u(0x00000000)
#define POWMAN_READ_TIME_LOWER_MSB    _u(31)
#define POWMAN_READ_TIME_LOWER_LSB    _u(0)
#define POWMAN_READ_TIME_LOWER_ACCESS "RO"
// =============================================================================
// Register    : POWMAN_ALARM_TIME_63TO48
// Description : This field must only be written when POWMAN_ALARM_ENAB=0
#define POWMAN_ALARM_TIME_63TO48_OFFSET _u(0x00000078)
#define POWMAN_ALARM_TIME_63TO48_BITS   _u(0x0000ffff)
#define POWMAN_ALARM_TIME_63TO48_RESET  _u(0x00000000)
#define POWMAN_ALARM_TIME_63TO48_MSB    _u(15)
#define POWMAN_ALARM_TIME_63TO48_LSB    _u(0)
#define POWMAN_ALARM_TIME_63TO48_ACCESS "RW"
// =============================================================================
// Register    : POWMAN_ALARM_TIME_47TO32
// Description : This field must only be written when POWMAN_ALARM_ENAB=0
#define POWMAN_ALARM_TIME_47TO32_OFFSET _u(0x0000007c)
#define POWMAN_ALARM_TIME_47TO32_BITS   _u(0x0000ffff)
#define POWMAN_ALARM_TIME_47TO32_RESET  _u(0x00000000)
#define POWMAN_ALARM_TIME_47TO32_MSB    _u(15)
#define POWMAN_ALARM_TIME_47TO32_LSB    _u(0)
#define POWMAN_ALARM_TIME_47TO32_ACCESS "RW"
// =============================================================================
// Register    : POWMAN_ALARM_TIME_31TO16
// Description : This field must only be written when POWMAN_ALARM_ENAB=0
#define POWMAN_ALARM_TIME_31TO16_OFFSET _u(0x00000080)
#define POWMAN_ALARM_TIME_31TO16_BITS   _u(0x0000ffff)
#define POWMAN_ALARM_TIME_31TO16_RESET  _u(0x00000000)
#define POWMAN_ALARM_TIME_31TO16_MSB    _u(15)
#define POWMAN_ALARM_TIME_31TO16_LSB    _u(0)
#define POWMAN_ALARM_TIME_31TO16_ACCESS "RW"
// =============================================================================
// Register    : POWMAN_ALARM_TIME_15TO0
// Description : This field must only be written when POWMAN_ALARM_ENAB=0
#define POWMAN_ALARM_TIME_15TO0_OFFSET _u(0x00000084)
#define POWMAN_ALARM_TIME_15TO0_BITS   _u(0x0000ffff)
#define POWMAN_ALARM_TIME_15TO0_RESET  _u(0x00000000)
#define POWMAN_ALARM_TIME_15TO0_MSB    _u(15)
#define POWMAN_ALARM_TIME_15TO0_LSB    _u(0)
#define POWMAN_ALARM_TIME_15TO0_ACCESS "RW"
// =============================================================================
// Register    : POWMAN_TIMER
#define POWMAN_TIMER_OFFSET _u(0x00000088)
#define POWMAN_TIMER_BITS   _u(0x000f2777)
#define POWMAN_TIMER_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : POWMAN_TIMER_USING_GPIO_1HZ
// Description : Timer is synchronised to a 1hz gpio source
#define POWMAN_TIMER_USING_GPIO_1HZ_RESET  _u(0x0)
#define POWMAN_TIMER_USING_GPIO_1HZ_BITS   _u(0x00080000)
#define POWMAN_TIMER_USING_GPIO_1HZ_MSB    _u(19)
#define POWMAN_TIMER_USING_GPIO_1HZ_LSB    _u(19)
#define POWMAN_TIMER_USING_GPIO_1HZ_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : POWMAN_TIMER_USING_GPIO_1KHZ
// Description : Timer is running from a 1khz gpio source
#define POWMAN_TIMER_USING_GPIO_1KHZ_RESET  _u(0x0)
#define POWMAN_TIMER_USING_GPIO_1KHZ_BITS   _u(0x00040000)
#define POWMAN_TIMER_USING_GPIO_1KHZ_MSB    _u(18)
#define POWMAN_TIMER_USING_GPIO_1KHZ_LSB    _u(18)
#define POWMAN_TIMER_USING_GPIO_1KHZ_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : POWMAN_TIMER_USING_LPOSC
// Description : Timer is running from lposc
#define POWMAN_TIMER_USING_LPOSC_RESET  _u(0x0)
#define POWMAN_TIMER_USING_LPOSC_BITS   _u(0x00020000)
#define POWMAN_TIMER_USING_LPOSC_MSB    _u(17)
#define POWMAN_TIMER_USING_LPOSC_LSB    _u(17)
#define POWMAN_TIMER_USING_LPOSC_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : POWMAN_TIMER_USING_XOSC
// Description : Timer is running from xosc
#define POWMAN_TIMER_USING_XOSC_RESET  _u(0x0)
#define POWMAN_TIMER_USING_XOSC_BITS   _u(0x00010000)
#define POWMAN_TIMER_USING_XOSC_MSB    _u(16)
#define POWMAN_TIMER_USING_XOSC_LSB    _u(16)
#define POWMAN_TIMER_USING_XOSC_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : POWMAN_TIMER_USE_GPIO_1HZ
// Description : Selects the gpio source as the reference for the sec counter.
//               The msec counter will continue to use the lposc or xosc
//               reference.
#define POWMAN_TIMER_USE_GPIO_1HZ_RESET  _u(0x0)
#define POWMAN_TIMER_USE_GPIO_1HZ_BITS   _u(0x00002000)
#define POWMAN_TIMER_USE_GPIO_1HZ_MSB    _u(13)
#define POWMAN_TIMER_USE_GPIO_1HZ_LSB    _u(13)
#define POWMAN_TIMER_USE_GPIO_1HZ_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : POWMAN_TIMER_USE_GPIO_1KHZ
// Description : switch to gpio as the source of the 1kHz timer tick
#define POWMAN_TIMER_USE_GPIO_1KHZ_RESET  _u(0x0)
#define POWMAN_TIMER_USE_GPIO_1KHZ_BITS   _u(0x00000400)
#define POWMAN_TIMER_USE_GPIO_1KHZ_MSB    _u(10)
#define POWMAN_TIMER_USE_GPIO_1KHZ_LSB    _u(10)
#define POWMAN_TIMER_USE_GPIO_1KHZ_ACCESS "SC"
// -----------------------------------------------------------------------------
// Field       : POWMAN_TIMER_USE_XOSC
