Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/powman.h
// Description : switch to xosc as the source of the 1kHz timer tick
#define POWMAN_TIMER_USE_XOSC_RESET  _u(0x0)
#define POWMAN_TIMER_USE_XOSC_BITS   _u(0x00000200)
#define POWMAN_TIMER_USE_XOSC_MSB    _u(9)
#define POWMAN_TIMER_USE_XOSC_LSB    _u(9)
#define POWMAN_TIMER_USE_XOSC_ACCESS "SC"
// -----------------------------------------------------------------------------
// Field       : POWMAN_TIMER_USE_LPOSC
// Description : Switch to lposc as the source of the 1kHz timer tick
#define POWMAN_TIMER_USE_LPOSC_RESET  _u(0x0)
#define POWMAN_TIMER_USE_LPOSC_BITS   _u(0x00000100)
#define POWMAN_TIMER_USE_LPOSC_MSB    _u(8)
#define POWMAN_TIMER_USE_LPOSC_LSB    _u(8)
#define POWMAN_TIMER_USE_LPOSC_ACCESS "SC"
// -----------------------------------------------------------------------------
// Field       : POWMAN_TIMER_ALARM
// Description : Alarm has fired. Write to 1 to clear the alarm.
#define POWMAN_TIMER_ALARM_RESET  _u(0x0)
#define POWMAN_TIMER_ALARM_BITS   _u(0x00000040)
#define POWMAN_TIMER_ALARM_MSB    _u(6)
#define POWMAN_TIMER_ALARM_LSB    _u(6)
#define POWMAN_TIMER_ALARM_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : POWMAN_TIMER_PWRUP_ON_ALARM
// Description : Alarm wakes the chip from low power mode
#define POWMAN_TIMER_PWRUP_ON_ALARM_RESET  _u(0x0)
#define POWMAN_TIMER_PWRUP_ON_ALARM_BITS   _u(0x00000020)
#define POWMAN_TIMER_PWRUP_ON_ALARM_MSB    _u(5)
#define POWMAN_TIMER_PWRUP_ON_ALARM_LSB    _u(5)
#define POWMAN_TIMER_PWRUP_ON_ALARM_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : POWMAN_TIMER_ALARM_ENAB
// Description : Enables the alarm. The alarm must be disabled while writing the
//               alarm time.
#define POWMAN_TIMER_ALARM_ENAB_RESET  _u(0x0)
#define POWMAN_TIMER_ALARM_ENAB_BITS   _u(0x00000010)
#define POWMAN_TIMER_ALARM_ENAB_MSB    _u(4)
#define POWMAN_TIMER_ALARM_ENAB_LSB    _u(4)
#define POWMAN_TIMER_ALARM_ENAB_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : POWMAN_TIMER_CLEAR
// Description : Clears the timer, does not disable the timer and does not
//               affect the alarm. This control can be written at any time.
#define POWMAN_TIMER_CLEAR_RESET  _u(0x0)
#define POWMAN_TIMER_CLEAR_BITS   _u(0x00000004)
#define POWMAN_TIMER_CLEAR_MSB    _u(2)
#define POWMAN_TIMER_CLEAR_LSB    _u(2)
#define POWMAN_TIMER_CLEAR_ACCESS "SC"
// -----------------------------------------------------------------------------
// Field       : POWMAN_TIMER_RUN
// Description : Timer enable. Setting this bit causes the timer to begin
//               counting up from its current value. Clearing this bit stops the
//               timer from counting.
//
//               Before enabling the timer, set the POWMAN_LPOSC_FREQ* and
//               POWMAN_XOSC_FREQ* registers to configure the count rate, and
//               initialise the current time by writing to SET_TIME_63TO48
//               through SET_TIME_15TO0. You must not write to the SET_TIME_x
//               registers when the timer is running.
//
//               Once configured, start the timer by setting POWMAN_TIMER_RUN=1.
//               This will start the timer running from the LPOSC. When the XOSC
//               is available switch the reference clock to XOSC then select it
//               as the timer clock by setting POWMAN_TIMER_USE_XOSC=1
#define POWMAN_TIMER_RUN_RESET  _u(0x0)
#define POWMAN_TIMER_RUN_BITS   _u(0x00000002)
#define POWMAN_TIMER_RUN_MSB    _u(1)
#define POWMAN_TIMER_RUN_LSB    _u(1)
#define POWMAN_TIMER_RUN_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : POWMAN_TIMER_NONSEC_WRITE
// Description : Control whether Non-secure software can write to the timer
//               registers. All other registers are hardwired to be inaccessible
//               to Non-secure.
#define POWMAN_TIMER_NONSEC_WRITE_RESET  _u(0x0)
#define POWMAN_TIMER_NONSEC_WRITE_BITS   _u(0x00000001)
#define POWMAN_TIMER_NONSEC_WRITE_MSB    _u(0)
#define POWMAN_TIMER_NONSEC_WRITE_LSB    _u(0)
#define POWMAN_TIMER_NONSEC_WRITE_ACCESS "RW"
// =============================================================================
// Register    : POWMAN_PWRUP0
// Description : 4 GPIO powerup events can be configured to wake the chip up
//               from a low power state.
//               The pwrups are level/edge sensitive and can be set to trigger
//               on a high/rising or low/falling event
//               The number of gpios available depends on the package option. An
//               invalid selection will be ignored
//               source = 0 selects gpio0
//               .
//               .
//               source = 47 selects gpio47
//               source = 48 selects qspi_ss
//               source = 49 selects qspi_sd0
//               source = 50 selects qspi_sd1
//               source = 51 selects qspi_sd2
//               source = 52 selects qspi_sd3
//               source = 53 selects qspi_sclk
//               level  = 0 triggers the pwrup when the source is low
//               level  = 1 triggers the pwrup when the source is high
#define POWMAN_PWRUP0_OFFSET _u(0x0000008c)
#define POWMAN_PWRUP0_BITS   _u(0x000007ff)
#define POWMAN_PWRUP0_RESET  _u(0x0000003f)
// -----------------------------------------------------------------------------
// Field       : POWMAN_PWRUP0_RAW_STATUS
// Description : Value of selected gpio pin (only if enable == 1)
#define POWMAN_PWRUP0_RAW_STATUS_RESET  _u(0x0)
#define POWMAN_PWRUP0_RAW_STATUS_BITS   _u(0x00000400)
#define POWMAN_PWRUP0_RAW_STATUS_MSB    _u(10)
#define POWMAN_PWRUP0_RAW_STATUS_LSB    _u(10)
#define POWMAN_PWRUP0_RAW_STATUS_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : POWMAN_PWRUP0_STATUS
// Description : Status of gpio wakeup. Write to 1 to clear a latched edge
//               detect.
#define POWMAN_PWRUP0_STATUS_RESET  _u(0x0)
#define POWMAN_PWRUP0_STATUS_BITS   _u(0x00000200)
#define POWMAN_PWRUP0_STATUS_MSB    _u(9)
#define POWMAN_PWRUP0_STATUS_LSB    _u(9)
#define POWMAN_PWRUP0_STATUS_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : POWMAN_PWRUP0_MODE
// Description : Edge or level detect. Edge will detect a 0 to 1 transition (or
//               1 to 0 transition). Level will detect a 1 or 0. Both types of
//               event get latched into the current_pwrup_req register.
//               0x0 -> level
//               0x1 -> edge
#define POWMAN_PWRUP0_MODE_RESET  _u(0x0)
#define POWMAN_PWRUP0_MODE_BITS   _u(0x00000100)
#define POWMAN_PWRUP0_MODE_MSB    _u(8)
#define POWMAN_PWRUP0_MODE_LSB    _u(8)
#define POWMAN_PWRUP0_MODE_ACCESS "RW"
#define POWMAN_PWRUP0_MODE_VALUE_LEVEL _u(0x0)
#define POWMAN_PWRUP0_MODE_VALUE_EDGE _u(0x1)
// -----------------------------------------------------------------------------
// Field       : POWMAN_PWRUP0_DIRECTION
//               0x0 -> low_falling
//               0x1 -> high_rising
#define POWMAN_PWRUP0_DIRECTION_RESET  _u(0x0)
#define POWMAN_PWRUP0_DIRECTION_BITS   _u(0x00000080)
#define POWMAN_PWRUP0_DIRECTION_MSB    _u(7)
#define POWMAN_PWRUP0_DIRECTION_LSB    _u(7)
#define POWMAN_PWRUP0_DIRECTION_ACCESS "RW"
#define POWMAN_PWRUP0_DIRECTION_VALUE_LOW_FALLING _u(0x0)
#define POWMAN_PWRUP0_DIRECTION_VALUE_HIGH_RISING _u(0x1)
// -----------------------------------------------------------------------------
// Field       : POWMAN_PWRUP0_ENABLE
// Description : Set to 1 to enable the wakeup source. Set to 0 to disable the
//               wakeup source and clear a pending wakeup event.
//               If using edge detect a latched edge needs to be cleared by
//               writing 1 to the status register also.
#define POWMAN_PWRUP0_ENABLE_RESET  _u(0x0)
#define POWMAN_PWRUP0_ENABLE_BITS   _u(0x00000040)
#define POWMAN_PWRUP0_ENABLE_MSB    _u(6)
#define POWMAN_PWRUP0_ENABLE_LSB    _u(6)
#define POWMAN_PWRUP0_ENABLE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : POWMAN_PWRUP0_SOURCE
#define POWMAN_PWRUP0_SOURCE_RESET  _u(0x3f)
#define POWMAN_PWRUP0_SOURCE_BITS   _u(0x0000003f)
#define POWMAN_PWRUP0_SOURCE_MSB    _u(5)
#define POWMAN_PWRUP0_SOURCE_LSB    _u(0)
#define POWMAN_PWRUP0_SOURCE_ACCESS "RW"
// =============================================================================
// Register    : POWMAN_PWRUP1
// Description : 4 GPIO powerup events can be configured to wake the chip up
//               from a low power state.
//               The pwrups are level/edge sensitive and can be set to trigger
//               on a high/rising or low/falling event
//               The number of gpios available depends on the package option. An
//               invalid selection will be ignored
//               source = 0 selects gpio0
//               .
//               .
//               source = 47 selects gpio47
//               source = 48 selects qspi_ss
//               source = 49 selects qspi_sd0
//               source = 50 selects qspi_sd1
//               source = 51 selects qspi_sd2
//               source = 52 selects qspi_sd3
//               source = 53 selects qspi_sclk
//               level  = 0 triggers the pwrup when the source is low
//               level  = 1 triggers the pwrup when the source is high
#define POWMAN_PWRUP1_OFFSET _u(0x00000090)
#define POWMAN_PWRUP1_BITS   _u(0x000007ff)
#define POWMAN_PWRUP1_RESET  _u(0x0000003f)
// -----------------------------------------------------------------------------
// Field       : POWMAN_PWRUP1_RAW_STATUS
// Description : Value of selected gpio pin (only if enable == 1)
#define POWMAN_PWRUP1_RAW_STATUS_RESET  _u(0x0)
#define POWMAN_PWRUP1_RAW_STATUS_BITS   _u(0x00000400)
#define POWMAN_PWRUP1_RAW_STATUS_MSB    _u(10)
#define POWMAN_PWRUP1_RAW_STATUS_LSB    _u(10)
#define POWMAN_PWRUP1_RAW_STATUS_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : POWMAN_PWRUP1_STATUS
// Description : Status of gpio wakeup. Write to 1 to clear a latched edge
//               detect.
#define POWMAN_PWRUP1_STATUS_RESET  _u(0x0)
#define POWMAN_PWRUP1_STATUS_BITS   _u(0x00000200)
#define POWMAN_PWRUP1_STATUS_MSB    _u(9)
#define POWMAN_PWRUP1_STATUS_LSB    _u(9)
#define POWMAN_PWRUP1_STATUS_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : POWMAN_PWRUP1_MODE
// Description : Edge or level detect. Edge will detect a 0 to 1 transition (or
//               1 to 0 transition). Level will detect a 1 or 0. Both types of
//               event get latched into the current_pwrup_req register.
//               0x0 -> level
//               0x1 -> edge
#define POWMAN_PWRUP1_MODE_RESET  _u(0x0)
#define POWMAN_PWRUP1_MODE_BITS   _u(0x00000100)
#define POWMAN_PWRUP1_MODE_MSB    _u(8)
#define POWMAN_PWRUP1_MODE_LSB    _u(8)
#define POWMAN_PWRUP1_MODE_ACCESS "RW"
#define POWMAN_PWRUP1_MODE_VALUE_LEVEL _u(0x0)
#define POWMAN_PWRUP1_MODE_VALUE_EDGE _u(0x1)
// -----------------------------------------------------------------------------
// Field       : POWMAN_PWRUP1_DIRECTION
//               0x0 -> low_falling
//               0x1 -> high_rising
#define POWMAN_PWRUP1_DIRECTION_RESET  _u(0x0)
#define POWMAN_PWRUP1_DIRECTION_BITS   _u(0x00000080)
#define POWMAN_PWRUP1_DIRECTION_MSB    _u(7)
#define POWMAN_PWRUP1_DIRECTION_LSB    _u(7)
#define POWMAN_PWRUP1_DIRECTION_ACCESS "RW"
#define POWMAN_PWRUP1_DIRECTION_VALUE_LOW_FALLING _u(0x0)
#define POWMAN_PWRUP1_DIRECTION_VALUE_HIGH_RISING _u(0x1)
// -----------------------------------------------------------------------------
// Field       : POWMAN_PWRUP1_ENABLE
// Description : Set to 1 to enable the wakeup source. Set to 0 to disable the
//               wakeup source and clear a pending wakeup event.
//               If using edge detect a latched edge needs to be cleared by
//               writing 1 to the status register also.
#define POWMAN_PWRUP1_ENABLE_RESET  _u(0x0)
#define POWMAN_PWRUP1_ENABLE_BITS   _u(0x00000040)
#define POWMAN_PWRUP1_ENABLE_MSB    _u(6)
#define POWMAN_PWRUP1_ENABLE_LSB    _u(6)
#define POWMAN_PWRUP1_ENABLE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : POWMAN_PWRUP1_SOURCE
#define POWMAN_PWRUP1_SOURCE_RESET  _u(0x3f)
#define POWMAN_PWRUP1_SOURCE_BITS   _u(0x0000003f)
#define POWMAN_PWRUP1_SOURCE_MSB    _u(5)
#define POWMAN_PWRUP1_SOURCE_LSB    _u(0)
#define POWMAN_PWRUP1_SOURCE_ACCESS "RW"
// =============================================================================
// Register    : POWMAN_PWRUP2
// Description : 4 GPIO powerup events can be configured to wake the chip up
//               from a low power state.
//               The pwrups are level/edge sensitive and can be set to trigger
//               on a high/rising or low/falling event
//               The number of gpios available depends on the package option. An
//               invalid selection will be ignored
//               source = 0 selects gpio0
//               .
//               .
//               source = 47 selects gpio47
//               source = 48 selects qspi_ss
//               source = 49 selects qspi_sd0
//               source = 50 selects qspi_sd1
//               source = 51 selects qspi_sd2
//               source = 52 selects qspi_sd3
//               source = 53 selects qspi_sclk
//               level  = 0 triggers the pwrup when the source is low
//               level  = 1 triggers the pwrup when the source is high
#define POWMAN_PWRUP2_OFFSET _u(0x00000094)
#define POWMAN_PWRUP2_BITS   _u(0x000007ff)
#define POWMAN_PWRUP2_RESET  _u(0x0000003f)
// -----------------------------------------------------------------------------
// Field       : POWMAN_PWRUP2_RAW_STATUS
// Description : Value of selected gpio pin (only if enable == 1)
#define POWMAN_PWRUP2_RAW_STATUS_RESET  _u(0x0)
#define POWMAN_PWRUP2_RAW_STATUS_BITS   _u(0x00000400)
#define POWMAN_PWRUP2_RAW_STATUS_MSB    _u(10)
#define POWMAN_PWRUP2_RAW_STATUS_LSB    _u(10)
#define POWMAN_PWRUP2_RAW_STATUS_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : POWMAN_PWRUP2_STATUS
// Description : Status of gpio wakeup. Write to 1 to clear a latched edge
//               detect.
#define POWMAN_PWRUP2_STATUS_RESET  _u(0x0)
#define POWMAN_PWRUP2_STATUS_BITS   _u(0x00000200)
#define POWMAN_PWRUP2_STATUS_MSB    _u(9)
#define POWMAN_PWRUP2_STATUS_LSB    _u(9)
#define POWMAN_PWRUP2_STATUS_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : POWMAN_PWRUP2_MODE
// Description : Edge or level detect. Edge will detect a 0 to 1 transition (or
//               1 to 0 transition). Level will detect a 1 or 0. Both types of
//               event get latched into the current_pwrup_req register.
//               0x0 -> level
//               0x1 -> edge
#define POWMAN_PWRUP2_MODE_RESET  _u(0x0)
#define POWMAN_PWRUP2_MODE_BITS   _u(0x00000100)
#define POWMAN_PWRUP2_MODE_MSB    _u(8)
#define POWMAN_PWRUP2_MODE_LSB    _u(8)
#define POWMAN_PWRUP2_MODE_ACCESS "RW"
#define POWMAN_PWRUP2_MODE_VALUE_LEVEL _u(0x0)
#define POWMAN_PWRUP2_MODE_VALUE_EDGE _u(0x1)
// -----------------------------------------------------------------------------
// Field       : POWMAN_PWRUP2_DIRECTION
//               0x0 -> low_falling
//               0x1 -> high_rising
#define POWMAN_PWRUP2_DIRECTION_RESET  _u(0x0)
#define POWMAN_PWRUP2_DIRECTION_BITS   _u(0x00000080)
#define POWMAN_PWRUP2_DIRECTION_MSB    _u(7)
#define POWMAN_PWRUP2_DIRECTION_LSB    _u(7)
#define POWMAN_PWRUP2_DIRECTION_ACCESS "RW"
#define POWMAN_PWRUP2_DIRECTION_VALUE_LOW_FALLING _u(0x0)
#define POWMAN_PWRUP2_DIRECTION_VALUE_HIGH_RISING _u(0x1)
// -----------------------------------------------------------------------------
// Field       : POWMAN_PWRUP2_ENABLE
// Description : Set to 1 to enable the wakeup source. Set to 0 to disable the
//               wakeup source and clear a pending wakeup event.
//               If using edge detect a latched edge needs to be cleared by
//               writing 1 to the status register also.
#define POWMAN_PWRUP2_ENABLE_RESET  _u(0x0)
#define POWMAN_PWRUP2_ENABLE_BITS   _u(0x00000040)
#define POWMAN_PWRUP2_ENABLE_MSB    _u(6)
#define POWMAN_PWRUP2_ENABLE_LSB    _u(6)
#define POWMAN_PWRUP2_ENABLE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : POWMAN_PWRUP2_SOURCE
#define POWMAN_PWRUP2_SOURCE_RESET  _u(0x3f)
#define POWMAN_PWRUP2_SOURCE_BITS   _u(0x0000003f)
#define POWMAN_PWRUP2_SOURCE_MSB    _u(5)
#define POWMAN_PWRUP2_SOURCE_LSB    _u(0)
#define POWMAN_PWRUP2_SOURCE_ACCESS "RW"
// =============================================================================
// Register    : POWMAN_PWRUP3
// Description : 4 GPIO powerup events can be configured to wake the chip up
//               from a low power state.
//               The pwrups are level/edge sensitive and can be set to trigger
//               on a high/rising or low/falling event
//               The number of gpios available depends on the package option. An
//               invalid selection will be ignored
//               source = 0 selects gpio0
//               .
//               .
//               source = 47 selects gpio47
//               source = 48 selects qspi_ss
//               source = 49 selects qspi_sd0
//               source = 50 selects qspi_sd1
//               source = 51 selects qspi_sd2
//               source = 52 selects qspi_sd3
//               source = 53 selects qspi_sclk
//               level  = 0 triggers the pwrup when the source is low
//               level  = 1 triggers the pwrup when the source is high
#define POWMAN_PWRUP3_OFFSET _u(0x00000098)
#define POWMAN_PWRUP3_BITS   _u(0x000007ff)
#define POWMAN_PWRUP3_RESET  _u(0x0000003f)
// -----------------------------------------------------------------------------
// Field       : POWMAN_PWRUP3_RAW_STATUS
// Description : Value of selected gpio pin (only if enable == 1)
#define POWMAN_PWRUP3_RAW_STATUS_RESET  _u(0x0)
#define POWMAN_PWRUP3_RAW_STATUS_BITS   _u(0x00000400)
#define POWMAN_PWRUP3_RAW_STATUS_MSB    _u(10)
#define POWMAN_PWRUP3_RAW_STATUS_LSB    _u(10)
#define POWMAN_PWRUP3_RAW_STATUS_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : POWMAN_PWRUP3_STATUS
// Description : Status of gpio wakeup. Write to 1 to clear a latched edge
//               detect.
#define POWMAN_PWRUP3_STATUS_RESET  _u(0x0)
#define POWMAN_PWRUP3_STATUS_BITS   _u(0x00000200)
#define POWMAN_PWRUP3_STATUS_MSB    _u(9)
#define POWMAN_PWRUP3_STATUS_LSB    _u(9)
#define POWMAN_PWRUP3_STATUS_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : POWMAN_PWRUP3_MODE
// Description : Edge or level detect. Edge will detect a 0 to 1 transition (or
//               1 to 0 transition). Level will detect a 1 or 0. Both types of
//               event get latched into the current_pwrup_req register.
//               0x0 -> level
//               0x1 -> edge
#define POWMAN_PWRUP3_MODE_RESET  _u(0x0)
#define POWMAN_PWRUP3_MODE_BITS   _u(0x00000100)
#define POWMAN_PWRUP3_MODE_MSB    _u(8)
#define POWMAN_PWRUP3_MODE_LSB    _u(8)
#define POWMAN_PWRUP3_MODE_ACCESS "RW"
#define POWMAN_PWRUP3_MODE_VALUE_LEVEL _u(0x0)
#define POWMAN_PWRUP3_MODE_VALUE_EDGE _u(0x1)
// -----------------------------------------------------------------------------
// Field       : POWMAN_PWRUP3_DIRECTION
//               0x0 -> low_falling
//               0x1 -> high_rising
#define POWMAN_PWRUP3_DIRECTION_RESET  _u(0x0)
#define POWMAN_PWRUP3_DIRECTION_BITS   _u(0x00000080)
#define POWMAN_PWRUP3_DIRECTION_MSB    _u(7)
#define POWMAN_PWRUP3_DIRECTION_LSB    _u(7)
#define POWMAN_PWRUP3_DIRECTION_ACCESS "RW"
#define POWMAN_PWRUP3_DIRECTION_VALUE_LOW_FALLING _u(0x0)
#define POWMAN_PWRUP3_DIRECTION_VALUE_HIGH_RISING _u(0x1)
// -----------------------------------------------------------------------------
// Field       : POWMAN_PWRUP3_ENABLE
// Description : Set to 1 to enable the wakeup source. Set to 0 to disable the
//               wakeup source and clear a pending wakeup event.
//               If using edge detect a latched edge needs to be cleared by
//               writing 1 to the status register also.
#define POWMAN_PWRUP3_ENABLE_RESET  _u(0x0)
#define POWMAN_PWRUP3_ENABLE_BITS   _u(0x00000040)
#define POWMAN_PWRUP3_ENABLE_MSB    _u(6)
#define POWMAN_PWRUP3_ENABLE_LSB    _u(6)
#define POWMAN_PWRUP3_ENABLE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : POWMAN_PWRUP3_SOURCE
#define POWMAN_PWRUP3_SOURCE_RESET  _u(0x3f)
#define POWMAN_PWRUP3_SOURCE_BITS   _u(0x0000003f)
#define POWMAN_PWRUP3_SOURCE_MSB    _u(5)
#define POWMAN_PWRUP3_SOURCE_LSB    _u(0)
#define POWMAN_PWRUP3_SOURCE_ACCESS "RW"
// =============================================================================
// Register    : POWMAN_CURRENT_PWRUP_REQ
// Description : Indicates current powerup request state
//               pwrup events can be cleared by removing the enable from the
//               pwrup register. The alarm pwrup req can be cleared by clearing
//               timer.alarm_enab
//               0 = chip reset, for the source of the last reset see
//               POWMAN_CHIP_RESET
//               1 = pwrup0
//               2 = pwrup1
//               3 = pwrup2
//               4 = pwrup3
//               5 = coresight_pwrup
//               6 = alarm_pwrup
#define POWMAN_CURRENT_PWRUP_REQ_OFFSET _u(0x0000009c)
#define POWMAN_CURRENT_PWRUP_REQ_BITS   _u(0x0000007f)
#define POWMAN_CURRENT_PWRUP_REQ_RESET  _u(0x00000000)
#define POWMAN_CURRENT_PWRUP_REQ_MSB    _u(6)
#define POWMAN_CURRENT_PWRUP_REQ_LSB    _u(0)
#define POWMAN_CURRENT_PWRUP_REQ_ACCESS "RO"
// =============================================================================
// Register    : POWMAN_LAST_SWCORE_PWRUP
// Description : Indicates which pwrup source triggered the last switched-core
//               power up
//               0 = chip reset, for the source of the last reset see
//               POWMAN_CHIP_RESET
//               1 = pwrup0
//               2 = pwrup1
//               3 = pwrup2
//               4 = pwrup3
//               5 = coresight_pwrup
//               6 = alarm_pwrup
#define POWMAN_LAST_SWCORE_PWRUP_OFFSET _u(0x000000a0)
#define POWMAN_LAST_SWCORE_PWRUP_BITS   _u(0x0000007f)
#define POWMAN_LAST_SWCORE_PWRUP_RESET  _u(0x00000000)
#define POWMAN_LAST_SWCORE_PWRUP_MSB    _u(6)
#define POWMAN_LAST_SWCORE_PWRUP_LSB    _u(0)
#define POWMAN_LAST_SWCORE_PWRUP_ACCESS "RO"
// =============================================================================
// Register    : POWMAN_DBG_PWRCFG
#define POWMAN_DBG_PWRCFG_OFFSET _u(0x000000a4)
#define POWMAN_DBG_PWRCFG_BITS   _u(0x00000001)
#define POWMAN_DBG_PWRCFG_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : POWMAN_DBG_PWRCFG_IGNORE
// Description : Ignore pwrup req from debugger. If pwrup req is asserted then
//               this will prevent power down and set powerdown blocked. Set
//               ignore to stop paying attention to pwrup_req
#define POWMAN_DBG_PWRCFG_IGNORE_RESET  _u(0x0)
#define POWMAN_DBG_PWRCFG_IGNORE_BITS   _u(0x00000001)
#define POWMAN_DBG_PWRCFG_IGNORE_MSB    _u(0)
#define POWMAN_DBG_PWRCFG_IGNORE_LSB    _u(0)
#define POWMAN_DBG_PWRCFG_IGNORE_ACCESS "RW"
// =============================================================================
// Register    : POWMAN_BOOTDIS
