Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/powman.h
// Description : Tell the bootrom to ignore the BOOT0..3 registers following the
//               next RSM reset (e.g. the next core power down/up).
//
//               If an early boot stage has soft-locked some OTP pages in order
//               to protect their contents from later stages, there is a risk
//               that Secure code running at a later stage can unlock the pages
//               by powering the core up and down.
//
//               This register can be used to ensure that the bootloader runs as
//               normal on the next power up, preventing Secure code at a later
//               stage from accessing OTP in its unlocked state.
//
//               Should be used in conjunction with the OTP BOOTDIS register.
#define POWMAN_BOOTDIS_OFFSET _u(0x000000a8)
#define POWMAN_BOOTDIS_BITS   _u(0x00000003)
#define POWMAN_BOOTDIS_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : POWMAN_BOOTDIS_NEXT
// Description : This flag always ORs writes into its current contents. It can
//               be set but not cleared by software.
//
//               The BOOTDIS_NEXT bit is OR'd into the BOOTDIS_NOW bit when the
//               core is powered down. Simultaneously, the BOOTDIS_NEXT bit is
//               cleared. Setting this bit means that the BOOT0..3 registers
//               will be ignored following the next reset of the RSM by powman.
//
//               This flag should be set by an early boot stage that has soft-
//               locked OTP pages, to prevent later stages from unlocking it by
//               power cycling.
#define POWMAN_BOOTDIS_NEXT_RESET  _u(0x0)
#define POWMAN_BOOTDIS_NEXT_BITS   _u(0x00000002)
#define POWMAN_BOOTDIS_NEXT_MSB    _u(1)
#define POWMAN_BOOTDIS_NEXT_LSB    _u(1)
#define POWMAN_BOOTDIS_NEXT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : POWMAN_BOOTDIS_NOW
// Description : When powman resets the RSM, the current value of BOOTDIS_NEXT
//               is OR'd into BOOTDIS_NOW, and BOOTDIS_NEXT is cleared.
//
//               The bootrom checks this flag before reading the BOOT0..3
//               registers. If it is set, the bootrom clears it, and ignores the
//               BOOT registers. This prevents Secure software from diverting
//               the boot path before a bootloader has had the chance to soft
//               lock OTP pages containing sensitive data.
#define POWMAN_BOOTDIS_NOW_RESET  _u(0x0)
#define POWMAN_BOOTDIS_NOW_BITS   _u(0x00000001)
#define POWMAN_BOOTDIS_NOW_MSB    _u(0)
#define POWMAN_BOOTDIS_NOW_LSB    _u(0)
#define POWMAN_BOOTDIS_NOW_ACCESS "WC"
// =============================================================================
// Register    : POWMAN_DBGCONFIG
#define POWMAN_DBGCONFIG_OFFSET _u(0x000000ac)
#define POWMAN_DBGCONFIG_BITS   _u(0x0000000f)
#define POWMAN_DBGCONFIG_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : POWMAN_DBGCONFIG_DP_INSTID
// Description : Configure DP instance ID for SWD multidrop selection.
//               Recommend that this is NOT changed until you require debug
//               access in multi-chip environment
#define POWMAN_DBGCONFIG_DP_INSTID_RESET  _u(0x0)
#define POWMAN_DBGCONFIG_DP_INSTID_BITS   _u(0x0000000f)
#define POWMAN_DBGCONFIG_DP_INSTID_MSB    _u(3)
#define POWMAN_DBGCONFIG_DP_INSTID_LSB    _u(0)
#define POWMAN_DBGCONFIG_DP_INSTID_ACCESS "RW"
// =============================================================================
// Register    : POWMAN_SCRATCH0
// Description : Scratch register. Information persists in low power mode
#define POWMAN_SCRATCH0_OFFSET _u(0x000000b0)
#define POWMAN_SCRATCH0_BITS   _u(0xffffffff)
#define POWMAN_SCRATCH0_RESET  _u(0x00000000)
#define POWMAN_SCRATCH0_MSB    _u(31)
#define POWMAN_SCRATCH0_LSB    _u(0)
#define POWMAN_SCRATCH0_ACCESS "RW"
// =============================================================================
// Register    : POWMAN_SCRATCH1
// Description : Scratch register. Information persists in low power mode
#define POWMAN_SCRATCH1_OFFSET _u(0x000000b4)
#define POWMAN_SCRATCH1_BITS   _u(0xffffffff)
#define POWMAN_SCRATCH1_RESET  _u(0x00000000)
#define POWMAN_SCRATCH1_MSB    _u(31)
#define POWMAN_SCRATCH1_LSB    _u(0)
#define POWMAN_SCRATCH1_ACCESS "RW"
// =============================================================================
// Register    : POWMAN_SCRATCH2
// Description : Scratch register. Information persists in low power mode
#define POWMAN_SCRATCH2_OFFSET _u(0x000000b8)
#define POWMAN_SCRATCH2_BITS   _u(0xffffffff)
#define POWMAN_SCRATCH2_RESET  _u(0x00000000)
#define POWMAN_SCRATCH2_MSB    _u(31)
#define POWMAN_SCRATCH2_LSB    _u(0)
#define POWMAN_SCRATCH2_ACCESS "RW"
// =============================================================================
// Register    : POWMAN_SCRATCH3
// Description : Scratch register. Information persists in low power mode
#define POWMAN_SCRATCH3_OFFSET _u(0x000000bc)
#define POWMAN_SCRATCH3_BITS   _u(0xffffffff)
#define POWMAN_SCRATCH3_RESET  _u(0x00000000)
#define POWMAN_SCRATCH3_MSB    _u(31)
#define POWMAN_SCRATCH3_LSB    _u(0)
#define POWMAN_SCRATCH3_ACCESS "RW"
// =============================================================================
// Register    : POWMAN_SCRATCH4
// Description : Scratch register. Information persists in low power mode
#define POWMAN_SCRATCH4_OFFSET _u(0x000000c0)
#define POWMAN_SCRATCH4_BITS   _u(0xffffffff)
#define POWMAN_SCRATCH4_RESET  _u(0x00000000)
#define POWMAN_SCRATCH4_MSB    _u(31)
#define POWMAN_SCRATCH4_LSB    _u(0)
#define POWMAN_SCRATCH4_ACCESS "RW"
// =============================================================================
// Register    : POWMAN_SCRATCH5
// Description : Scratch register. Information persists in low power mode
#define POWMAN_SCRATCH5_OFFSET _u(0x000000c4)
#define POWMAN_SCRATCH5_BITS   _u(0xffffffff)
#define POWMAN_SCRATCH5_RESET  _u(0x00000000)
#define POWMAN_SCRATCH5_MSB    _u(31)
#define POWMAN_SCRATCH5_LSB    _u(0)
#define POWMAN_SCRATCH5_ACCESS "RW"
// =============================================================================
// Register    : POWMAN_SCRATCH6
// Description : Scratch register. Information persists in low power mode
#define POWMAN_SCRATCH6_OFFSET _u(0x000000c8)
#define POWMAN_SCRATCH6_BITS   _u(0xffffffff)
#define POWMAN_SCRATCH6_RESET  _u(0x00000000)
#define POWMAN_SCRATCH6_MSB    _u(31)
#define POWMAN_SCRATCH6_LSB    _u(0)
#define POWMAN_SCRATCH6_ACCESS "RW"
// =============================================================================
// Register    : POWMAN_SCRATCH7
// Description : Scratch register. Information persists in low power mode
#define POWMAN_SCRATCH7_OFFSET _u(0x000000cc)
#define POWMAN_SCRATCH7_BITS   _u(0xffffffff)
#define POWMAN_SCRATCH7_RESET  _u(0x00000000)
#define POWMAN_SCRATCH7_MSB    _u(31)
#define POWMAN_SCRATCH7_LSB    _u(0)
#define POWMAN_SCRATCH7_ACCESS "RW"
// =============================================================================
// Register    : POWMAN_BOOT0
// Description : Scratch register. Information persists in low power mode
#define POWMAN_BOOT0_OFFSET _u(0x000000d0)
#define POWMAN_BOOT0_BITS   _u(0xffffffff)
#define POWMAN_BOOT0_RESET  _u(0x00000000)
#define POWMAN_BOOT0_MSB    _u(31)
#define POWMAN_BOOT0_LSB    _u(0)
#define POWMAN_BOOT0_ACCESS "RW"
// =============================================================================
// Register    : POWMAN_BOOT1
// Description : Scratch register. Information persists in low power mode
#define POWMAN_BOOT1_OFFSET _u(0x000000d4)
#define POWMAN_BOOT1_BITS   _u(0xffffffff)
#define POWMAN_BOOT1_RESET  _u(0x00000000)
#define POWMAN_BOOT1_MSB    _u(31)
#define POWMAN_BOOT1_LSB    _u(0)
#define POWMAN_BOOT1_ACCESS "RW"
// =============================================================================
// Register    : POWMAN_BOOT2
// Description : Scratch register. Information persists in low power mode
#define POWMAN_BOOT2_OFFSET _u(0x000000d8)
#define POWMAN_BOOT2_BITS   _u(0xffffffff)
#define POWMAN_BOOT2_RESET  _u(0x00000000)
#define POWMAN_BOOT2_MSB    _u(31)
#define POWMAN_BOOT2_LSB    _u(0)
#define POWMAN_BOOT2_ACCESS "RW"
// =============================================================================
// Register    : POWMAN_BOOT3
// Description : Scratch register. Information persists in low power mode
#define POWMAN_BOOT3_OFFSET _u(0x000000dc)
#define POWMAN_BOOT3_BITS   _u(0xffffffff)
#define POWMAN_BOOT3_RESET  _u(0x00000000)
#define POWMAN_BOOT3_MSB    _u(31)
#define POWMAN_BOOT3_LSB    _u(0)
#define POWMAN_BOOT3_ACCESS "RW"
// =============================================================================
// Register    : POWMAN_INTR
// Description : Raw Interrupts
#define POWMAN_INTR_OFFSET _u(0x000000e0)
#define POWMAN_INTR_BITS   _u(0x0000000f)
#define POWMAN_INTR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : POWMAN_INTR_PWRUP_WHILE_WAITING
// Description : Source is state.pwrup_while_waiting
#define POWMAN_INTR_PWRUP_WHILE_WAITING_RESET  _u(0x0)
#define POWMAN_INTR_PWRUP_WHILE_WAITING_BITS   _u(0x00000008)
#define POWMAN_INTR_PWRUP_WHILE_WAITING_MSB    _u(3)
#define POWMAN_INTR_PWRUP_WHILE_WAITING_LSB    _u(3)
#define POWMAN_INTR_PWRUP_WHILE_WAITING_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : POWMAN_INTR_STATE_REQ_IGNORED
// Description : Source is state.req_ignored
#define POWMAN_INTR_STATE_REQ_IGNORED_RESET  _u(0x0)
#define POWMAN_INTR_STATE_REQ_IGNORED_BITS   _u(0x00000004)
#define POWMAN_INTR_STATE_REQ_IGNORED_MSB    _u(2)
#define POWMAN_INTR_STATE_REQ_IGNORED_LSB    _u(2)
#define POWMAN_INTR_STATE_REQ_IGNORED_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : POWMAN_INTR_TIMER
#define POWMAN_INTR_TIMER_RESET  _u(0x0)
#define POWMAN_INTR_TIMER_BITS   _u(0x00000002)
#define POWMAN_INTR_TIMER_MSB    _u(1)
#define POWMAN_INTR_TIMER_LSB    _u(1)
#define POWMAN_INTR_TIMER_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : POWMAN_INTR_VREG_OUTPUT_LOW
#define POWMAN_INTR_VREG_OUTPUT_LOW_RESET  _u(0x0)
#define POWMAN_INTR_VREG_OUTPUT_LOW_BITS   _u(0x00000001)
#define POWMAN_INTR_VREG_OUTPUT_LOW_MSB    _u(0)
#define POWMAN_INTR_VREG_OUTPUT_LOW_LSB    _u(0)
#define POWMAN_INTR_VREG_OUTPUT_LOW_ACCESS "WC"
// =============================================================================
// Register    : POWMAN_INTE
// Description : Interrupt Enable
#define POWMAN_INTE_OFFSET _u(0x000000e4)
#define POWMAN_INTE_BITS   _u(0x0000000f)
#define POWMAN_INTE_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : POWMAN_INTE_PWRUP_WHILE_WAITING
// Description : Source is state.pwrup_while_waiting
#define POWMAN_INTE_PWRUP_WHILE_WAITING_RESET  _u(0x0)
#define POWMAN_INTE_PWRUP_WHILE_WAITING_BITS   _u(0x00000008)
#define POWMAN_INTE_PWRUP_WHILE_WAITING_MSB    _u(3)
#define POWMAN_INTE_PWRUP_WHILE_WAITING_LSB    _u(3)
#define POWMAN_INTE_PWRUP_WHILE_WAITING_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : POWMAN_INTE_STATE_REQ_IGNORED
// Description : Source is state.req_ignored
#define POWMAN_INTE_STATE_REQ_IGNORED_RESET  _u(0x0)
#define POWMAN_INTE_STATE_REQ_IGNORED_BITS   _u(0x00000004)
#define POWMAN_INTE_STATE_REQ_IGNORED_MSB    _u(2)
#define POWMAN_INTE_STATE_REQ_IGNORED_LSB    _u(2)
#define POWMAN_INTE_STATE_REQ_IGNORED_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : POWMAN_INTE_TIMER
#define POWMAN_INTE_TIMER_RESET  _u(0x0)
#define POWMAN_INTE_TIMER_BITS   _u(0x00000002)
#define POWMAN_INTE_TIMER_MSB    _u(1)
#define POWMAN_INTE_TIMER_LSB    _u(1)
#define POWMAN_INTE_TIMER_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : POWMAN_INTE_VREG_OUTPUT_LOW
#define POWMAN_INTE_VREG_OUTPUT_LOW_RESET  _u(0x0)
#define POWMAN_INTE_VREG_OUTPUT_LOW_BITS   _u(0x00000001)
#define POWMAN_INTE_VREG_OUTPUT_LOW_MSB    _u(0)
#define POWMAN_INTE_VREG_OUTPUT_LOW_LSB    _u(0)
#define POWMAN_INTE_VREG_OUTPUT_LOW_ACCESS "RW"
// =============================================================================
// Register    : POWMAN_INTF
// Description : Interrupt Force
#define POWMAN_INTF_OFFSET _u(0x000000e8)
#define POWMAN_INTF_BITS   _u(0x0000000f)
#define POWMAN_INTF_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : POWMAN_INTF_PWRUP_WHILE_WAITING
// Description : Source is state.pwrup_while_waiting
#define POWMAN_INTF_PWRUP_WHILE_WAITING_RESET  _u(0x0)
#define POWMAN_INTF_PWRUP_WHILE_WAITING_BITS   _u(0x00000008)
#define POWMAN_INTF_PWRUP_WHILE_WAITING_MSB    _u(3)
#define POWMAN_INTF_PWRUP_WHILE_WAITING_LSB    _u(3)
#define POWMAN_INTF_PWRUP_WHILE_WAITING_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : POWMAN_INTF_STATE_REQ_IGNORED
// Description : Source is state.req_ignored
#define POWMAN_INTF_STATE_REQ_IGNORED_RESET  _u(0x0)
#define POWMAN_INTF_STATE_REQ_IGNORED_BITS   _u(0x00000004)
#define POWMAN_INTF_STATE_REQ_IGNORED_MSB    _u(2)
#define POWMAN_INTF_STATE_REQ_IGNORED_LSB    _u(2)
#define POWMAN_INTF_STATE_REQ_IGNORED_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : POWMAN_INTF_TIMER
#define POWMAN_INTF_TIMER_RESET  _u(0x0)
#define POWMAN_INTF_TIMER_BITS   _u(0x00000002)
#define POWMAN_INTF_TIMER_MSB    _u(1)
#define POWMAN_INTF_TIMER_LSB    _u(1)
#define POWMAN_INTF_TIMER_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : POWMAN_INTF_VREG_OUTPUT_LOW
#define POWMAN_INTF_VREG_OUTPUT_LOW_RESET  _u(0x0)
#define POWMAN_INTF_VREG_OUTPUT_LOW_BITS   _u(0x00000001)
#define POWMAN_INTF_VREG_OUTPUT_LOW_MSB    _u(0)
#define POWMAN_INTF_VREG_OUTPUT_LOW_LSB    _u(0)
#define POWMAN_INTF_VREG_OUTPUT_LOW_ACCESS "RW"
// =============================================================================
// Register    : POWMAN_INTS
// Description : Interrupt status after masking & forcing
#define POWMAN_INTS_OFFSET _u(0x000000ec)
#define POWMAN_INTS_BITS   _u(0x0000000f)
#define POWMAN_INTS_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : POWMAN_INTS_PWRUP_WHILE_WAITING
// Description : Source is state.pwrup_while_waiting
#define POWMAN_INTS_PWRUP_WHILE_WAITING_RESET  _u(0x0)
#define POWMAN_INTS_PWRUP_WHILE_WAITING_BITS   _u(0x00000008)
#define POWMAN_INTS_PWRUP_WHILE_WAITING_MSB    _u(3)
#define POWMAN_INTS_PWRUP_WHILE_WAITING_LSB    _u(3)
#define POWMAN_INTS_PWRUP_WHILE_WAITING_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : POWMAN_INTS_STATE_REQ_IGNORED
// Description : Source is state.req_ignored
#define POWMAN_INTS_STATE_REQ_IGNORED_RESET  _u(0x0)
#define POWMAN_INTS_STATE_REQ_IGNORED_BITS   _u(0x00000004)
#define POWMAN_INTS_STATE_REQ_IGNORED_MSB    _u(2)
#define POWMAN_INTS_STATE_REQ_IGNORED_LSB    _u(2)
#define POWMAN_INTS_STATE_REQ_IGNORED_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : POWMAN_INTS_TIMER
#define POWMAN_INTS_TIMER_RESET  _u(0x0)
#define POWMAN_INTS_TIMER_BITS   _u(0x00000002)
#define POWMAN_INTS_TIMER_MSB    _u(1)
#define POWMAN_INTS_TIMER_LSB    _u(1)
#define POWMAN_INTS_TIMER_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : POWMAN_INTS_VREG_OUTPUT_LOW
#define POWMAN_INTS_VREG_OUTPUT_LOW_RESET  _u(0x0)
#define POWMAN_INTS_VREG_OUTPUT_LOW_BITS   _u(0x00000001)
#define POWMAN_INTS_VREG_OUTPUT_LOW_MSB    _u(0)
#define POWMAN_INTS_VREG_OUTPUT_LOW_LSB    _u(0)
#define POWMAN_INTS_VREG_OUTPUT_LOW_ACCESS "RO"
// =============================================================================
#endif // _HARDWARE_REGS_POWMAN_H

